docs/howto/basics.org
#+TITLE: Basic HotDrink Usage
#+LANGUAGE:  en
#+OPTIONS: H:2 author:nil creator:nil
#+HTML_HEAD_EXTRA: <script type="text/javascript" src="hotdrink.min.js"></script>
#+HTML_HEAD_EXTRA: <script type="text/javascript" src="collapse.js"></script>
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="style.css"/>

* Introduction

This document describes the basics of how to create a property model, and how
that property model operates and interacts with the rest of your web
application.  We feel that you should not have to use a library without
understanding exactly how it is working and what it is doing for you.
Therefore, in this document we set aside the shortcuts and convenience
functions of HotDrink so that it will be clear exactly how a property model
works.  Then we slowly lay the groundwork for the shortcuts, making it clear
what they are doing for you.  After reading this document, you should have a
foundation for understanding what HotDrink is doing without feeling like it is
\ldquo{}magic\rdquo.

* Creating a constraint system

The most fundamental part of a GUI written with HotDrink is the constraint
system which represents data dependencies in your GUI.  This first example
shows how to create variables and constraints for that system, and how you can
directly interact with variables.

We assume here that you have read the document [[file:intro.org][Introduction to HotDrink]] and
are therefore familiar with the basic concept of a constraint system.

