howto/basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Basic HotDrink Usage</title>
<!-- 2015-10-27 Tue 08:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Basic HotDrink Usage</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Creating a constraint system</a>
<ul>
<li><a href="#sec-2-1">2.1. The example</a></li>
<li><a href="#sec-2-2">2.2. Working with the context builder</a></li>
<li><a href="#sec-2-3">2.3. Interacting with variables</a></li>
<li><a href="#sec-2-4">2.4. Updating the property model</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Simplified binding</a>
<ul>
<li><a href="#sec-3-1">3.1. The example</a></li>
<li><a href="#sec-3-2">3.2. A view-to-model binding</a></li>
<li><a href="#sec-3-3">3.3. A model-to-view binding</a></li>
<li><a href="#sec-3-4">3.4. A bi-directional binding</a></li>
<li><a href="#sec-3-5">3.5. The importance of binding</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Adapters and translators</a>
<ul>
<li><a href="#sec-4-1">4.1. The example</a></li>
<li><a href="#sec-4-2">4.2. View adapters</a></li>
<li><a href="#sec-4-3">4.3. Translators</a></li>
<li><a href="#sec-4-4">4.4. Connections</a></li>
</ul>
</li>
<li><a href="#sec-5">5. The <code>bind</code> function and binding descriptions</a>
<ul>
<li><a href="#sec-5-1">5.1. The example</a></li>
<li><a href="#sec-5-2">5.2. Translator factories</a></li>
<li><a href="#sec-5-3">5.3. Binding descriptions</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Multi-way constraints</a>
<ul>
<li><a href="#sec-6-1">6.1. The example</a></li>
<li><a href="#sec-6-2">6.2. Updating the constraint system</a></li>
<li><a href="#sec-6-3">6.3. Declaring multiple variables at once</a></li>
<li><a href="#sec-6-4">6.4. Reusing functions</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Input/output variables</a>
<ul>
<li><a href="#sec-7-1">7.1. The example</a></li>
<li><a href="#sec-7-2">7.2. Previous variable values</a></li>
<li><a href="#sec-7-3">7.3. Caveat</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Multiple output variables</a>
<ul>
<li><a href="#sec-8-1">8.1. The example</a></li>
<li><a href="#sec-8-2">8.2. Multiple return values</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Declarative binding</a>
<ul>
<li><a href="#sec-9-1">9.1. The example</a></li>
<li><a href="#sec-9-2">9.2. Automatic binding function</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Shortcut: binding specification factories</a>
<ul>
<li><a href="#sec-10-1">10.1. The example</a></li>
<li><a href="#sec-10-2">10.2. Factory functions</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Shortcut: equations</a>
<ul>
<li><a href="#sec-11-1">11.1. The example</a></li>
<li><a href="#sec-11-2">11.2. Allowable equations</a></li>
<li><a href="#sec-11-3">11.3. Implementation</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes the basics of how to create a property model, and how
that property model operates and interacts with the rest of your web
application.  We feel that you should not have to use a library without
understanding exactly how it is working and what it is doing for you.
Therefore, in this document we set aside the shortcuts and convenience
functions of HotDrink so that it will be clear exactly how a property model
works.  Then we slowly lay the groundwork for the shortcuts, making it clear
what they are doing for you.  After reading this document, you should have a
foundation for understanding what HotDrink is doing without feeling like it is
&ldquo;magic&rdquo;.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Creating a constraint system</h2>
<div class="outline-text-2" id="text-2">
<p>
The most fundamental part of a GUI written with HotDrink is the constraint
system which represents data dependencies in your GUI.  This first example
shows how to create variables and constraints for that system, and how you can
directly interact with variables.
</p>

<p>
We assume here that you have read the document <a href="intro.html">Introduction to HotDrink</a> and
are therefore familiar with the basic concept of a constraint system.
</p>
</div>
