docs/howto/basics.org
*** Creating variables

Just as in a programming language, values in HotDrink are stored in variables.
Note, however, that HotDrink variables are /not/ the same as JavaScript
variables; HotDrink variables are actually JavaScript objects.  Variables are
created with the model builder using the ~variable~ member function and then
stored in the model.  To create a variable you must specify a name; you may
optionally specify an initial value.  As with JavaScript variables,
uninitialized variables are given the value ~undefined~.  For example, the
line below creates a variable named ~emails~ which is initialized with a list
of email addresses.

#+NAME: emailvar
#+BEGIN_SRC js
    .variable( 'emails', 'joe@foo.com, sue@fum.edu, eve@foo.com, bob@baz.org' )
#+END_SRC

As mentioned previously, the return value of the ~variable~ function is the
builder object itself in order to facilitate chaining.

Builder member functions such as ~variable~ are used frequently when declaring
a property model.  To make them easier to use, the model builder provides
abbreviated names for many of them.  For example, you may refer to the
~variable~ member function simply as ~v~.  This is perhaps slightly less
readable, but much easier to type; we will use the abbreviated name ~v~ in the
remainder of the examples.

*** Creating constraints

Recall from [[file:intro.org][the introduction]] that a constraint is something that should always
be true concerning some of your variables---i.e., a /relation/ over the
variables.  In the example above, the relation is that ~result~ should contain
just those addresses in ~emails~ for which ~filter~ is a substring.

To define a constraint, you must specify the variables involved.  To make this
simple, the ~constraint~ member function of the model builder takes a string
containing all of the variables' names in a comma delimited list.  In this
example we define a single constraint for the variables ~emaisl~, ~filter~, and
~result~, as shown on the line below.

#+NAME: emailcon
#+BEGIN_SRC js
    .constraint( 'emails, filter, result' )
#+END_SRC

The return value of the ~constraint~ member function is the builder. The
~constraint~ member function may be abbreviated as ~c~; we will use this
abbreviation in the remainder of the examples.

*** Creating methods

Notice that, when you create a constraint, you do /not/ tell HotDrink what
relation the constraint represents.  Instead, you define a constraint by
providing /constraint satisfaction methods/, or just /methods/ for short.  A
method is a function whose parameters are /some/ variables of the constraint,
and which returns new values for /other/ variables of the constraint.  The
purpose of a method is to provide new values for its output variables that
will satisfy the constraint.

The method creation function of the model builder, named ~method~, takes a
signature and a function.  The signature is a string defining which variables
are inputs and which are outputs; it has the form "/inputs/ ~->~ /outputs/",
where both /inputs/ and /outputs/ are comma-delimited lists of variables.  For
this example we provide only a single method, shown below.  This method takes
~emails~ and ~filter~ and uses them to calculate ~result~.  You can have more
than one method per constraint; we'll discuss this further in later examples.

#+NAME: emailmth
#+BEGIN_SRC js
    .method( 'emails, filter -> result',
             function( emails, filter ) {
               var words = emails.trim().split( /\s*,\s*/ );
               var filteredWords = words.filter( function( word ) {
                 return word.indexOf( filter ) > -1;
               } );
               return filteredWords.join( ', ' );
             } )
#+END_SRC

Note that in this example we provide an anonymous function as our method, but
this is not a requirement; methods can be named functions defined elsewhere.
Also note that it is not a requirement for function parameter names to match
the variables which should be passed to them; in fact, HotDrink has no way of
knowing what you named your parameters.  HotDrink will use the signature you
provided to decide what variables to pass to the function.

Whenever you call ~method~, the builder assumes you are adding a method to the
most recently defined constraint.  As with the other builder member functions,
the return value of ~method~ is the builder to facilitate chaining, and it may
be abbreviated as ~m~; we will use this abbreviation in the remainder of the
examples.

** Interacting with variables

Variables can be accessed via the context; for example, if your context is
stored in a variable named ~context~, then the variable ~emails~ is accessed
as ~context.emails~.  The value of variables can be retrieved using the ~get~
member function and modified using the variable's ~set~ member function.  If a
variable is registered with a property model (i.e., the variable is in a
context that has been added to the constraint system), then changes to the
variable's value will be noticed by the property model.

In the example above, the following function is called every time the user
clicks the "Get" button.  The function calls ~context.result.get~ to retrieve
the current value of the ~result~ variable; it then displays this value using
the standard ~alert~ function.


#+NAME: getresult
#+BEGIN_SRC js
getResult = function getResult() {
  alert( 'Result: ' + context.result.get() );
}
#+END_SRC

The following function is called every time the user clicks the "Set" button
for the email address list.  The function calls ~context.emails.get()~ to
retrieve the current value of the ~emails~ variable; this is used to
initialize the prompt.  Once the user enters a new value, it uses
~context.emails.set()~ to store it in the variable.

#+NAME: setemails
#+BEGIN_SRC js
setEmails = function setEmails() {
  var emails = window.prompt( 'Emails:', context.emails.get() );
  if (emails !== null) {
    context.emails.set( emails );
    pm.update();
  }
}
#+END_SRC

Note that in the next section we will introduce binding, which is a better way
to set and get variable values.

