howto/basics.html

<ol class="org-ol"><li><a id="sec-2-2-1"></a>Creating variables<br  /><div class="outline-text-4" id="text-2-2-1">
<p>
Just as in a programming language, values in HotDrink are stored in variables.
Note, however, that HotDrink variables are <i>not</i> the same as JavaScript
variables; HotDrink variables are actually JavaScript objects.  Variables are
created with the model builder using the <code>variable</code> member function and then
stored in the model.  To create a variable you must specify a name; you may
optionally specify an initial value.  As with JavaScript variables,
uninitialized variables are given the value <code>undefined</code>.  For example, the
line below creates a variable named <code>emails</code> which is initialized with a list
of email addresses.
</p>

<div class="org-src-container">

<pre class="src src-js" id="emailvar">    .variable( <span style="color: #008000;">'emails'</span>, <span style="color: #008000;">'joe@foo.com, sue@fum.edu, eve@foo.com, bob@baz.org'</span> )
</pre>
</div>

<p>
As mentioned previously, the return value of the <code>variable</code> function is the
builder object itself in order to facilitate chaining.
</p>

<p>
Builder member functions such as <code>variable</code> are used frequently when declaring
a property model.  To make them easier to use, the model builder provides
abbreviated names for many of them.  For example, you may refer to the
<code>variable</code> member function simply as <code>v</code>.  This is perhaps slightly less
readable, but much easier to type; we will use the abbreviated name <code>v</code> in the
remainder of the examples.
</p>
</div>
</li>

<li><a id="sec-2-2-2"></a>Creating constraints<br  /><div class="outline-text-4" id="text-2-2-2">
<p>
Recall from <a href="intro.html">the introduction</a> that a constraint is something that should always
be true concerning some of your variables&#x2014;i.e., a <i>relation</i> over the
variables.  In the example above, the relation is that <code>result</code> should contain
just those addresses in <code>emails</code> for which <code>filter</code> is a substring.
</p>

<p>
To define a constraint, you must specify the variables involved.  To make this
simple, the <code>constraint</code> member function of the model builder takes a string
containing all of the variables' names in a comma delimited list.  In this
example we define a single constraint for the variables <code>emaisl</code>, <code>filter</code>, and
<code>result</code>, as shown on the line below.
</p>

<div class="org-src-container">

<pre class="src src-js" id="emailcon">    .constraint( <span style="color: #008000;">'emails, filter, result'</span> )
</pre>
</div>

<p>
The return value of the <code>constraint</code> member function is the builder. The
<code>constraint</code> member function may be abbreviated as <code>c</code>; we will use this
abbreviation in the remainder of the examples.
</p>
</div>
</li>

<li><a id="sec-2-2-3"></a>Creating methods<br  /><div class="outline-text-4" id="text-2-2-3">
<p>
Notice that, when you create a constraint, you do <i>not</i> tell HotDrink what
relation the constraint represents.  Instead, you define a constraint by
providing <i>constraint satisfaction methods</i>, or just <i>methods</i> for short.  A
method is a function whose parameters are <i>some</i> variables of the constraint,
and which returns new values for <i>other</i> variables of the constraint.  The
purpose of a method is to provide new values for its output variables that
will satisfy the constraint.
</p>

<p>
The method creation function of the model builder, named <code>method</code>, takes a
signature and a function.  The signature is a string defining which variables
are inputs and which are outputs; it has the form "<i>inputs</i> <code>-&gt;</code> <i>outputs</i>",
where both <i>inputs</i> and <i>outputs</i> are comma-delimited lists of variables.  For
this example we provide only a single method, shown below.  This method takes
<code>emails</code> and <code>filter</code> and uses them to calculate <code>result</code>.  You can have more
than one method per constraint; we'll discuss this further in later examples.
</p>

<div class="org-src-container">

<pre class="src src-js" id="emailmth">    .method( <span style="color: #008000;">'emails, filter -&gt; result'</span>,
             <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">emails</span>, <span style="color: #BA36A5;">filter</span> ) {
               <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">words</span> = emails.trim().split( <span style="color: #008000;">/\s*,\s*/</span> );
               <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">filteredWords</span> = words.filter( <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">word</span> ) {
                 <span style="color: #0000FF;">return</span> word.indexOf( filter ) &gt; -1;
               } );
               <span style="color: #0000FF;">return</span> filteredWords.join( <span style="color: #008000;">', '</span> );
             } )
</pre>
</div>

<p>
Note that in this example we provide an anonymous function as our method, but
this is not a requirement; methods can be named functions defined elsewhere.
Also note that it is not a requirement for function parameter names to match
the variables which should be passed to them; in fact, HotDrink has no way of
knowing what you named your parameters.  HotDrink will use the signature you
provided to decide what variables to pass to the function.
</p>

<p>
Whenever you call <code>method</code>, the builder assumes you are adding a method to the
most recently defined constraint.  As with the other builder member functions,
the return value of <code>method</code> is the builder to facilitate chaining, and it may
be abbreviated as <code>m</code>; we will use this abbreviation in the remainder of the
examples.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Interacting with variables</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Variables can be accessed via the context; for example, if your context is
stored in a variable named <code>context</code>, then the variable <code>emails</code> is accessed
as <code>context.emails</code>.  The value of variables can be retrieved using the <code>get</code>
member function and modified using the variable's <code>set</code> member function.  If a
variable is registered with a property model (i.e., the variable is in a
context that has been added to the constraint system), then changes to the
variable's value will be noticed by the property model.
</p>

<p>
In the example above, the following function is called every time the user
clicks the "Get" button.  The function calls <code>context.result.get</code> to retrieve
the current value of the <code>result</code> variable; it then displays this value using
the standard <code>alert</code> function.
</p>


<div class="org-src-container">

<pre class="src src-js" id="getresult">getResult = <span style="color: #0000FF;">function</span> getResult() {
  alert( <span style="color: #008000;">'Result: '</span> + context.result.get() );
}
</pre>
</div>

<p>
The following function is called every time the user clicks the "Set" button
for the email address list.  The function calls <code>context.emails.get()</code> to
retrieve the current value of the <code>emails</code> variable; this is used to
initialize the prompt.  Once the user enters a new value, it uses
<code>context.emails.set()</code> to store it in the variable.
</p>

<div class="org-src-container">

<pre class="src src-js" id="setemails">setEmails = <span style="color: #0000FF;">function</span> setEmails() {
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">emails</span> = window.prompt( <span style="color: #008000;">'Emails:'</span>, context.emails.get() );
  <span style="color: #0000FF;">if</span> (emails !== <span style="color: #8b1a1a;">null</span>) {
    context.emails.set( emails );
    pm.update();
  }
}
</pre>
</div>

<p>
Note that in the next section we will introduce binding, which is a better way
to set and get variable values.
</p>
</div>
</div>
