docs/howto/basics.org
** Updating the property model

To /update/ the property model means to respond to changes that have been
made---such as added constraints or modified variables---by enforcing any
constraints which may no longer be satisfied.  The constraint system notices
when changes occur, and remembers the changes.  However, the constraint system
does not actually update until its ~update~ member function is called, as
shown below.  This allows you to package several changes into a single update.
In the example above, we call ~update~ after adding our context to the
property model, as well as after setting a variable.

#+NAME: update
#+BEGIN_SRC js
pm.update();
#+END_SRC

A more common way of updating the property model is by executing a /command/.
We will discuss commands a little later.

* Simplified binding

The previous example illustrates the simplest possible interaction with the
property model: getting and setting a variable's value, and updating the
property model.  However, most commonly we do not get and set variable value's
directly; instead we rely on /bindings/ to get and set them for us.  In this
example, we'll write our own very simple bindings to illustrate how this
process works.


The previous example interacted with the property model using only the ~get~
and ~set~ functions for variables.  In actuality, this is not the best way to
interact with variables of the property model because the property model
updates /asynchronously/.  This means that calling ~pm.update()~ does not
actually force the property model to update, but rather requests that it
update itself at the next available time.  Thus, you cannot be sure when a
variable's value will be updated.

A better way to interact with variables of the property model is by letting
them tell /you/ when they have updated.  A variable has an event that is
triggered every time its value changes.  We can register a callback function
for this event so that we update the web page every time the variable changes.
Similarly, most HTML input elements have an event that is triggered every time
their value changes.  We can register a callback function for this event so
that every time its.  Together, these callback functions represent a
/binding/---a connection between an element of the View and an element of the
View-Model.

