howto/basics.html

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Updating the property model</h3>
<div class="outline-text-3" id="text-2-4">
<p>
To <i>update</i> the property model means to respond to changes that have been
made&#x2014;such as added constraints or modified variables&#x2014;by enforcing any
constraints which may no longer be satisfied.  The constraint system notices
when changes occur, and remembers the changes.  However, the constraint system
does not actually update until its <code>update</code> member function is called, as
shown below.  This allows you to package several changes into a single update.
In the example above, we call <code>update</code> after adding our context to the
property model, as well as after setting a variable.
</p>

<div class="org-src-container">

<pre class="src src-js" id="update">pm.update();
</pre>
</div>

<p>
A more common way of updating the property model is by executing a <i>command</i>.
We will discuss commands a little later.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Simplified binding</h2>
<div class="outline-text-2" id="text-3">
<p>
The previous example illustrates the simplest possible interaction with the
property model: getting and setting a variable's value, and updating the
property model.  However, most commonly we do not get and set variable value's
directly; instead we rely on <i>bindings</i> to get and set them for us.  In this
example, we'll write our own very simple bindings to illustrate how this
process works.
</p>


<p>
The previous example interacted with the property model using only the <code>get</code>
and <code>set</code> functions for variables.  In actuality, this is not the best way to
interact with variables of the property model because the property model
updates <i>asynchronously</i>.  This means that calling <code>pm.update()</code> does not
actually force the property model to update, but rather requests that it
update itself at the next available time.  Thus, you cannot be sure when a
variable's value will be updated.
</p>

<p>
A better way to interact with variables of the property model is by letting
them tell <i>you</i> when they have updated.  A variable has an event that is
triggered every time its value changes.  We can register a callback function
for this event so that we update the web page every time the variable changes.
Similarly, most HTML input elements have an event that is triggered every time
their value changes.  We can register a callback function for this event so
that every time its.  Together, these callback functions represent a
<i>binding</i>&#x2014;a connection between an element of the View and an element of the
View-Model.
</p>
</div>
