docs/howto/basics.org
** A view-to-model binding

One job of a binding is to ensure that, if the user modifies a value in the
View, the corresponding variable is modified as well.  To accomplish this, we
register an event handler for the ~input~ event of the text-edit input, as
shown below.  The ~addEventListener~ function is the standard function for
registering a callback function for an HTML DOM node.

#+NAME: emailsEdit
#+BEGIN_SRC js
  emailsEdit.addEventListener( 'input', function() {
    context.emails.set( emailsEdit.value );
    pm.update()
  } );
#+END_SRC

The callback function we register simply uses the value of the text-edit input
to update the property model variable, then updates the property model.  Now,
every time the user edits the text input, the variable will be set to the same
value.

** A model-to-view binding

The other job of a binding is to ensure that, if the value of a variable
changes, the corresponding element of the View is modified as well.  Just like
DOM nodes, variables have an event that triggers every time its value is
modified.  Although the syntax for registering a callback is slightly
different, the semantics is the same.

#+NAME: resultSpan
#+BEGIN_SRC js
  context.result.addObserver( { onNext: function() {
    resultSpan.removeChild( resultSpan.lastChild );
    resultSpan.appendChild( document.createTextNode( context.result.get() ) );
  } } );
#+END_SRC

The callback function we register here simply deletes the old contents of the
~<span>~ tag and then adds the value of the variable as the new contents.
Now, every time the variable is modified, the span tag will be updated to
reflect the same value.

The interfaces for registering callbacks for events and for publishing your
own events for HotDrink to listen to is discussed in the [[file:binding.org][Advanced Binding
Concepts]] howto.

** A bi-directional binding

A bi-directional binding is simply a pair of bindings: one from view-to-model,
and one from model-to-view.  Together, these bindings ensure that any changes
in the View are propagated to the property model, and any changes in the
property model are propagated to the view.

** The importance of binding

Binding code tends to be highly reusable.  For example, we might write a
binding for a text-edit input, or for a span tag, and then reuse them any time
we want to bind to these elements.  This can often make binding a simple
matter of a few lines of code.

There is another important reason why we should use binding instead of simply
using the ~get~ and ~set~ methods of a variable directly.  Property models
update /asynchronously/.  This is discussed in depth in the [[file:async.org][Asynchronous
Methods]], but the important detail for now is that calling ~update~ on the
property model does /not/ execute any methods of the property model.  Instead,
it /schedules/ them to be run as soon as their inputs are available.

For example, consider the following code segment.

#+BEGIN_SRC js
context.filter.set( '.edu' );
pm.update();
alert( context.result.get() );
#+END_SRC

In this segment we set the value of a variable, update the property model,
then read the value of a different variable.  If you were to execute this
code, you would find the value of ~result~ that you read is /not/ the updated
value of ~result~; it is still the old value.  The new value won't be ready
until your method has a chance to execute.

This is why it is so important that we register a callback to run when the
variable changes.  As a general rule, we cannot be sure when the new value of
a variable will be ready.  By registering a callback, we allow the property
model to tell us when a new value of the variable is available.

* Adapters and translators

If we were to combine the observable and observer objects of the previous
example, we would get a single object, both observable and an observer, which
representing a text edit box of the View: when the object observes a value, it
updates the text box to contain that value, and when the user edits the text
box, it notifies any observers with the new value.  This object is called a
/view adapter/ because it converts the interface of the View---i.e., an HTML
DOM node---into the observable/observer interface used by HotDrink.

Often when a variable is bound to the view, the value contained in the View
will be slightly different than the value contained in the property model.  A
good example of this is a variable whose value is a number bound to a text box
whose value is a string.  While it is possible for an adapter to make such
data conversions, creating a separate object specifically to do this
conversion, called a /translator/, allows more flexibility by making it easy
to combine different adapters with different translators.

