howto/basics.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> A view-to-model binding</h3>
<div class="outline-text-3" id="text-3-2">
<p>
One job of a binding is to ensure that, if the user modifies a value in the
View, the corresponding variable is modified as well.  To accomplish this, we
register an event handler for the <code>input</code> event of the text-edit input, as
shown below.  The <code>addEventListener</code> function is the standard function for
registering a callback function for an HTML DOM node.
</p>

<div class="org-src-container">

<pre class="src src-js" id="emailsEdit">  emailsEdit.addEventListener( <span style="color: #008000;">'input'</span>, <span style="color: #0000FF;">function</span>() {
    context.emails.set( emailsEdit.value );
    pm.update()
  } );
</pre>
</div>

<p>
The callback function we register simply uses the value of the text-edit input
to update the property model variable, then updates the property model.  Now,
every time the user edits the text input, the variable will be set to the same
value.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> A model-to-view binding</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The other job of a binding is to ensure that, if the value of a variable
changes, the corresponding element of the View is modified as well.  Just like
DOM nodes, variables have an event that triggers every time its value is
modified.  Although the syntax for registering a callback is slightly
different, the semantics is the same.
</p>

<div class="org-src-container">

<pre class="src src-js" id="resultSpan">  context.result.addObserver( { onNext: <span style="color: #0000FF;">function</span>() {
    resultSpan.removeChild( resultSpan.lastChild );
    resultSpan.appendChild( document.createTextNode( context.result.get() ) );
  } } );
</pre>
</div>

<p>
The callback function we register here simply deletes the old contents of the
<code>&lt;span&gt;</code> tag and then adds the value of the variable as the new contents.
Now, every time the variable is modified, the span tag will be updated to
reflect the same value.
</p>

<p>
The interfaces for registering callbacks for events and for publishing your
own events for HotDrink to listen to is discussed in the <a href="binding.html">Advanced Binding
Concepts</a> howto.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> A bi-directional binding</h3>
<div class="outline-text-3" id="text-3-4">
<p>
A bi-directional binding is simply a pair of bindings: one from view-to-model,
and one from model-to-view.  Together, these bindings ensure that any changes
in the View are propagated to the property model, and any changes in the
property model are propagated to the view.
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> The importance of binding</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Binding code tends to be highly reusable.  For example, we might write a
binding for a text-edit input, or for a span tag, and then reuse them any time
we want to bind to these elements.  This can often make binding a simple
matter of a few lines of code.
</p>

<p>
There is another important reason why we should use binding instead of simply
using the <code>get</code> and <code>set</code> methods of a variable directly.  Property models
update <i>asynchronously</i>.  This is discussed in depth in the <a href="async.html">Asynchronous
Methods</a>, but the important detail for now is that calling <code>update</code> on the
property model does <i>not</i> execute any methods of the property model.  Instead,
it <i>schedules</i> them to be run as soon as their inputs are available.
</p>

<p>
For example, consider the following code segment.
</p>

<div class="org-src-container">

<pre class="src src-js">context.filter.set( <span style="color: #008000;">'.edu'</span> );
pm.update();
alert( context.result.get() );
</pre>
</div>

<p>
In this segment we set the value of a variable, update the property model,
then read the value of a different variable.  If you were to execute this
code, you would find the value of <code>result</code> that you read is <i>not</i> the updated
value of <code>result</code>; it is still the old value.  The new value won't be ready
until your method has a chance to execute.
</p>

<p>
This is why it is so important that we register a callback to run when the
variable changes.  As a general rule, we cannot be sure when the new value of
a variable will be ready.  By registering a callback, we allow the property
model to tell us when a new value of the variable is available.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Adapters and translators</h2>
<div class="outline-text-2" id="text-4">
<p>
If we were to combine the observable and observer objects of the previous
example, we would get a single object, both observable and an observer, which
representing a text edit box of the View: when the object observes a value, it
updates the text box to contain that value, and when the user edits the text
box, it notifies any observers with the new value.  This object is called a
<i>view adapter</i> because it converts the interface of the View&#x2014;i.e., an HTML
DOM node&#x2014;into the observable/observer interface used by HotDrink.
</p>

<p>
Often when a variable is bound to the view, the value contained in the View
will be slightly different than the value contained in the property model.  A
good example of this is a variable whose value is a number bound to a text box
whose value is a string.  While it is possible for an adapter to make such
data conversions, creating a separate object specifically to do this
conversion, called a <i>translator</i>, allows more flexibility by making it easy
to combine different adapters with different translators.
</p>
</div>
