docs/howto/basics.org
** View adapters

A /view adapter/ is an object which represents some element of the view which
can be bound to a property model.  It is called an /adapter/ because it adapts
the view element's interface to the observable/observer interface expected by
HotDrink.  A view adapter may be read-only (i.e., observable-only), read-write
(i.e., observable-observer), or write-only (i.e., observer-only).  For
example, an adapter for the mouse cursor position would be read-only; an
adapter for a text box would be read-write; and an adapter for a <span> tag
would be write-only.

HotDrink provides several types of view adapters for common input elements.
We describe them in detail in the [[file:binding.org][Advanced Binding Concepts]] how-to.  For now,
however, we introduce two adapters for use in the remainder of this how-to.

The first adapter type is the ~Edit~ adapter: a read-write adapter that
represents the value of a text box.  As an observable, the ~Edit~ adapter
reports every time the value of the text box changes.  As an observer, the
~Edit~ adapter updates the value of the text box every time the value of the
variable being observed changes.  To create an ~Edit~ adapter, simply create a
new ~hd.Edit~ object passing the DOM node for the text box to the constructor.

#+NAME: edit-adapter
#+BEGIN_SRC js
  // An adapter for the <input> element for income
  var incomeAdapter = new hd.Edit( document.getElementById( 'incomeEdit' ) );
#+END_SRC

Adapters can be creative in the way they choose to read or write values.  For
example, the ~Edit~ adapter does not report a new value with every keystroke;
it waits for either a half-second pause in the typing, or for an event that
indicates that the edit is complete, such as the user pressing the Enter key
or the text box losing focus.  Furthermore, if the adapter receives a new
value while the user is editing, the adapter waits until the text box loses
focus before updating its value.

The second adapter type is the ~Text~ adapter: a read-only adapter that
represents the text contents of a tag.  As an observer, the ~Text~ adapter
update the contents of its tag every time the value of the variable being
observed changes.  To create a ~Text~ adapter, simply create a new ~hd.Text~
object passing the DOM node for the tag to the constructor.

#+NAME: text-adapter
#+BEGIN_SRC js
  // An adapter for the <span> element for profit
  var profitAdapter = new hd.Text( document.getElementById( 'profitSpan' ) );
#+END_SRC

** Translators

The purpose of a translator is to convert a value between the format expected
by the View to the format expected by the View-Model.  A translator is both an
observable and an observer:  it observes the value of the View (or View-Model)
and produces a value for the View-Model (or the View).

Creating a translator is not hard, but it does tend to involve a lot of
boiler-plate code.  For this reason, HotDrink provides a simple implementation
of a translator called ~Translator~.  You may create instances of this type,
or use it as a prototype for your own JavaScript types.  As it is written,
this translator performs no translation; it simply takes the value it was
given and passes it on.  However, by assigning the translator a new ~onNext~
method, we can cause it to modify the values it is given.

#+NAME: number-translator
#+BEGIN_SRC js
  // A translator from string to number
  var incomeTranslator = new hd.Translator();
  incomeTranslator.onNext = stringToNumber;
#+END_SRC

The prototype for the ~Translator~ type is a ~BasicObservable~.  Thus, after
you have translated your value, you can use ~sendNext~ to pass on the
translated value.  Alternatively, you can use ~sendError~ to signal an error.

#+NAME: string-to-number
#+BEGIN_SRC js
// Helper function for translator:  convert string to number
function stringToNumber( s ) {
  var n = Number( s );
  if (s == '' || isNaN( n )) {
    this.sendError( "Invalid number" );
  }
  else {
    this.sendNext( n );
  }
}
#+END_SRC

Note that, while we could create an adapter to convert the number of the
View-Model to a string for the View, it is not strictly necessary.  JavaScript
will automatically convert our number to a string using ~toString~ when it is
assigned as the value of a text box.  This is sufficient for our text boxes.
However, in the case of our ~<span>~ tag, we would prefer to use
~toFixedString~ instead.  Thus, we define a translator for this tag.

#+NAME: fixed-translator
#+BEGIN_SRC js
  // A translator from number to string
  var profitTranslator = new hd.Translator();
  profitTranslator.onNext = fix2;
#+END_SRC
#+NAME: fix2
#+BEGIN_SRC js
// Helper function for translator:  convert number to string
function fix2( n ) {
  this.sendNext( n.toFixed( 2 ) );
}
#+END_SRC

