howto/basics.html
<span class="linenr">24: </span>  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">An adapter for the &lt;span&gt; element for profit</span>
<span class="linenr">25: </span>  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">profitAdapter</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Text</span>( document.getElementById( <span style="color: #008000;">'profitSpan'</span> ) );
<span class="linenr">26: </span>  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">A translator from number to string</span>
<span class="linenr">27: </span>  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">profitTranslator</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Translator</span>();
<span class="linenr">28: </span>  profitTranslator.onNext = fix2;
<span class="linenr">29: </span>  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Connect observables to observers</span>
<span class="linenr">30: </span>  context.profit.addObserver( profitTranslator );
<span class="linenr">31: </span>  profitTranslator.addObserver( profitAdapter );
<span class="linenr">32: </span>} )
<span class="linenr">33: </span>
<span class="linenr">34: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Helper function for translator:  convert string to number</span>
<span class="linenr">35: </span><span style="color: #0000FF;">function</span> <span style="color: #006699;">stringToNumber</span>( <span style="color: #BA36A5;">s</span> ) {
<span class="linenr">36: </span>  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">n</span> = Number( s );
<span class="linenr">37: </span>  <span style="color: #0000FF;">if</span> (s == <span style="color: #008000;">''</span> || isNaN( n )) {
<span class="linenr">38: </span>    <span style="color: #8b1a1a;">this</span>.sendError( <span style="color: #008000;">"Invalid number"</span> );
<span class="linenr">39: </span>  }
<span class="linenr">40: </span>  <span style="color: #0000FF;">else</span> {
<span class="linenr">41: </span>    <span style="color: #8b1a1a;">this</span>.sendNext( n );
<span class="linenr">42: </span>  }
<span class="linenr">43: </span>}
<span class="linenr">44: </span>
<span class="linenr">45: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Helper function for translator:  convert number to string</span>
<span class="linenr">46: </span><span style="color: #0000FF;">function</span> <span style="color: #006699;">fix2</span>( <span style="color: #BA36A5;">n</span> ) {
<span class="linenr">47: </span>  <span style="color: #8b1a1a;">this</span>.sendNext( n.toFixed( 2 ) );
<span class="linenr">48: </span>}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> View adapters</h3>
<div class="outline-text-3" id="text-4-2">
<p>
A <i>view adapter</i> is an object which represents some element of the view which
can be bound to a property model.  It is called an <i>adapter</i> because it adapts
the view element's interface to the observable/observer interface expected by
HotDrink.  A view adapter may be read-only (i.e., observable-only), read-write
(i.e., observable-observer), or write-only (i.e., observer-only).  For
example, an adapter for the mouse cursor position would be read-only; an
adapter for a text box would be read-write; and an adapter for a &lt;span&gt; tag
would be write-only.
</p>

<p>
HotDrink provides several types of view adapters for common input elements.
We describe them in detail in the <a href="binding.html">Advanced Binding Concepts</a> how-to.  For now,
however, we introduce two adapters for use in the remainder of this how-to.
</p>

<p>
The first adapter type is the <code>Edit</code> adapter: a read-write adapter that
represents the value of a text box.  As an observable, the <code>Edit</code> adapter
reports every time the value of the text box changes.  As an observer, the
<code>Edit</code> adapter updates the value of the text box every time the value of the
variable being observed changes.  To create an <code>Edit</code> adapter, simply create a
new <code>hd.Edit</code> object passing the DOM node for the text box to the constructor.
</p>

<div class="org-src-container">

<pre class="src src-js" id="edit-adapter">  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">An adapter for the &lt;input&gt; element for income</span>
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">incomeAdapter</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'incomeEdit'</span> ) );
</pre>
</div>

<p>
Adapters can be creative in the way they choose to read or write values.  For
example, the <code>Edit</code> adapter does not report a new value with every keystroke;
it waits for either a half-second pause in the typing, or for an event that
indicates that the edit is complete, such as the user pressing the Enter key
or the text box losing focus.  Furthermore, if the adapter receives a new
value while the user is editing, the adapter waits until the text box loses
focus before updating its value.
</p>

<p>
The second adapter type is the <code>Text</code> adapter: a read-only adapter that
represents the text contents of a tag.  As an observer, the <code>Text</code> adapter
update the contents of its tag every time the value of the variable being
observed changes.  To create a <code>Text</code> adapter, simply create a new <code>hd.Text</code>
object passing the DOM node for the tag to the constructor.
</p>

<div class="org-src-container">

<pre class="src src-js" id="text-adapter">  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">An adapter for the &lt;span&gt; element for profit</span>
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">profitAdapter</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Text</span>( document.getElementById( <span style="color: #008000;">'profitSpan'</span> ) );
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Translators</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The purpose of a translator is to convert a value between the format expected
by the View to the format expected by the View-Model.  A translator is both an
observable and an observer:  it observes the value of the View (or View-Model)
and produces a value for the View-Model (or the View).
</p>

<p>
Creating a translator is not hard, but it does tend to involve a lot of
boiler-plate code.  For this reason, HotDrink provides a simple implementation
of a translator called <code>Translator</code>.  You may create instances of this type,
or use it as a prototype for your own JavaScript types.  As it is written,
this translator performs no translation; it simply takes the value it was
given and passes it on.  However, by assigning the translator a new <code>onNext</code>
method, we can cause it to modify the values it is given.
</p>

<div class="org-src-container">

<pre class="src src-js" id="number-translator">  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">A translator from string to number</span>
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">incomeTranslator</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Translator</span>();
  incomeTranslator.onNext = stringToNumber;
</pre>
</div>

<p>
The prototype for the <code>Translator</code> type is a <code>BasicObservable</code>.  Thus, after
you have translated your value, you can use <code>sendNext</code> to pass on the
translated value.  Alternatively, you can use <code>sendError</code> to signal an error.
</p>

<div class="org-src-container">

<pre class="src src-js" id="string-to-number"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Helper function for translator:  convert string to number</span>
<span style="color: #0000FF;">function</span> <span style="color: #006699;">stringToNumber</span>( <span style="color: #BA36A5;">s</span> ) {
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">n</span> = Number( s );
  <span style="color: #0000FF;">if</span> (s == <span style="color: #008000;">''</span> || isNaN( n )) {
    <span style="color: #8b1a1a;">this</span>.sendError( <span style="color: #008000;">"Invalid number"</span> );
  }
  <span style="color: #0000FF;">else</span> {
    <span style="color: #8b1a1a;">this</span>.sendNext( n );
  }
}
</pre>
</div>

<p>
Note that, while we could create an adapter to convert the number of the
View-Model to a string for the View, it is not strictly necessary.  JavaScript
will automatically convert our number to a string using <code>toString</code> when it is
assigned as the value of a text box.  This is sufficient for our text boxes.
However, in the case of our <code>&lt;span&gt;</code> tag, we would prefer to use
<code>toFixedString</code> instead.  Thus, we define a translator for this tag.
</p>

<div class="org-src-container">

<pre class="src src-js" id="fixed-translator">  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">A translator from number to string</span>
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">profitTranslator</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Translator</span>();
  profitTranslator.onNext = fix2;
</pre>
</div>
<div class="org-src-container">

<pre class="src src-js" id="fix2"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Helper function for translator:  convert number to string</span>
<span style="color: #0000FF;">function</span> <span style="color: #006699;">fix2</span>( <span style="color: #BA36A5;">n</span> ) {
  <span style="color: #8b1a1a;">this</span>.sendNext( n.toFixed( 2 ) );
}
</pre>
</div>
</div>
</div>
