docs/howto/basics.org
** Connections

Once we have created an adapter and translator, all that is left is to connect
them by subscribing observers to observables.  To support values going from
the View to the View-Model, the translator subscribes to the adapter, and the
variable subscribes to the translator.  To support values going from the
View-Model to the View, the adapter subscribes directly to the variable.

#+NAME: connections
#+BEGIN_SRC js
  // Connect observables to observers
  incomeAdapter.addObserver( incomeTranslator );
  incomeTranslator.addObserver( context.income );
  context.income.addObserver( incomeAdapter );
#+END_SRC

At this point, the variable is bound to the View.  Any changes to the variable
will go directly to the View.  Any changes to the View will first go through
the translator, then to the variable.

Note that it is /not/ possible to reuse translators.  If you were to try, you
would have to subscribe the same translator to two view adapters, and two
variables to the same translator.  This would mean that every time either view
adapter sent a value, /both/ variables would receive the value.  Thus, e.g.,
we must create a second string-to-number translator for the =expenses=
variable; we cannot reuse the one for =income=.

* The ~bind~ function and binding descriptions

The code required to connect adapters, translators, and variables tends to be
somewhat repetitive.  To help avoid boilerplate code, HotDrink provides the
~bind~ function which can make these connections for you.

** The example

This example also contains a single constraint.  This time the constraint
represents the mathematical equation $subtotal*(1+tax/100)=total$.  As with
previous examples, updating the text box will cause the result to update
automatically.

This example performs all binding using the ~bind~ function with built-in
adapters and translators.

#+HTML: <div class="results">
#+INCLUDE: tangle/description.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/description.js html
#+HTML: })();
#+HTML: </script>

*Source Code*

#+CAPTION: /View/ (show/hide)
#+BEGIN_SRC html -n :exports code :tangle tangle/description.html :padline no
<table>
  <style type="text/css" scoped>
    th { padding-right: 1ex; text-align: left; font-weight: bold; }
  </style>
  <tr>
    <th>Subtotal:</th>
    <td><input type="text" id="subtotalEdit"/></td>
  </tr>
  <tr>
    <th>Tax:</th>
    <td><input type="text" id="taxEdit"/>%</td>
  </tr>
  <tr>
    <th>Total:</th>
    <td>$<span id="totalSpan"></span></td>
  </tr>
</table>
#+END_SRC

#+CAPTION: /View-Model/ (show/hide)
#+BEGIN_SRC js -n :exports code :tangle tangle/description.js :padline no
// Define the context
var context = new hd.ContextBuilder()
    .v( 'subtotal', 39.99 )
    .v( 'tax', 8 )
    .v( 'total' )

    .c( 'subtotal, tax, total' )
    .m( 'subtotal, tax -> total',
        function( subtotal, tax ) {
          return Math.round( subtotal * (100+tax) ) / 100;
        } )

    .context();

// Create the constraint system
var pm = new hd.PropertyModel();
pm.addComponent( context );
#+END_SRC

#+CAPTION: /Binding/ (show/hide)
#+BEGIN_SRC js -n :exports code :tangle tangle/description.js :padline no :noweb yes
window.addEventListener( 'load', function() {
<<binding-description>>
  hd.bind( {view:    new hd.Edit( document.getElementById( 'taxEdit' ) ),
            model:   context.tax,
            toModel: [hd.toNum(), hd.round( 0 )],
            toView:  hd.fix( 0 )
           }
         );
  hd.bind( {view:    new hd.Text( document.getElementById( 'totalSpan' ) ),
            model:   context.total,
            toModel: hd.fix( 2 )
           }
         );
} );
#+END_SRC

