howto/basics.html

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Connections</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Once we have created an adapter and translator, all that is left is to connect
them by subscribing observers to observables.  To support values going from
the View to the View-Model, the translator subscribes to the adapter, and the
variable subscribes to the translator.  To support values going from the
View-Model to the View, the adapter subscribes directly to the variable.
</p>

<div class="org-src-container">

<pre class="src src-js" id="connections">  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Connect observables to observers</span>
  incomeAdapter.addObserver( incomeTranslator );
  incomeTranslator.addObserver( context.income );
  context.income.addObserver( incomeAdapter );
</pre>
</div>

<p>
At this point, the variable is bound to the View.  Any changes to the variable
will go directly to the View.  Any changes to the View will first go through
the translator, then to the variable.
</p>

<p>
Note that it is <i>not</i> possible to reuse translators.  If you were to try, you
would have to subscribe the same translator to two view adapters, and two
variables to the same translator.  This would mean that every time either view
adapter sent a value, <i>both</i> variables would receive the value.  Thus, e.g.,
we must create a second string-to-number translator for the <code>expenses</code>
variable; we cannot reuse the one for <code>income</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> The <code>bind</code> function and binding descriptions</h2>
<div class="outline-text-2" id="text-5">
<p>
The code required to connect adapters, translators, and variables tends to be
somewhat repetitive.  To help avoid boilerplate code, HotDrink provides the
<code>bind</code> function which can make these connections for you.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> The example</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This example also contains a single constraint.  This time the constraint
represents the mathematical equation \(subtotal*(1+tax/100)=total\).  As with
previous examples, updating the text box will cause the result to update
automatically.
</p>

<p>
This example performs all binding using the <code>bind</code> function with built-in
adapters and translators.
</p>

<div class="results">
<table>
  <style type="text/css" scoped>
    th { padding-right: 1ex; text-align: left; font-weight: bold; }
  </style>
  <tr>
    <th>Subtotal:</th>
    <td><input type="text" id="subtotalEdit"/></td>
  </tr>
  <tr>
    <th>Tax:</th>
    <td><input type="text" id="taxEdit"/>%</td>
  </tr>
  <tr>
    <th>Total:</th>
    <td>$<span id="totalSpan"></span></td>
  </tr>
</table>
</div>
<script type="text/javascript">
(function() {
// Define the context
var context = new hd.ContextBuilder()
    .v( 'subtotal', 39.99 )
    .v( 'tax', 8 )
    .v( 'total' )

    .c( 'subtotal, tax, total' )
    .m( 'subtotal, tax -> total',
        function( subtotal, tax ) {
          return Math.round( subtotal * (100+tax) ) / 100;
        } )

    .context();

// Create the constraint system
var pm = new hd.PropertyModel();
pm.addComponent( context );
window.addEventListener( 'load', function() {
  hd.bind( {view:    new hd.Edit( document.getElementById( 'subtotalEdit' ) ),
            model:   context.subtotal,
            toModel: [hd.toNum(), hd.round( 2 )],
            toView:  hd.fix( 2 )
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'taxEdit' ) ),
            model:   context.tax,
            toModel: [hd.toNum(), hd.round( 0 )],
            toView:  hd.fix( 0 )
           }
         );
  hd.bind( {view:    new hd.Text( document.getElementById( 'totalSpan' ) ),
            model:   context.total,
            toModel: hd.fix( 2 )
           }
         );
} );
})();
</script>

<p>
<b>Source Code</b>
</p>

<div class="org-src-container">
<label class="org-src-name"><i>View</i> (show/hide)</label>
<pre class="src src-html"><span class="linenr"> 1: </span>&lt;<span style="color: #006699;">table</span>&gt;
<span class="linenr"> 2: </span>  &lt;<span style="color: #006699;">style</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span> scoped&gt;
<span class="linenr"> 3: </span>    th { padding-right: 1ex; text-align: left; font-weight: bold; }
<span class="linenr"> 4: </span>  &lt;/<span style="color: #006699;">style</span>&gt;
<span class="linenr"> 5: </span>  &lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr"> 6: </span>    &lt;<span style="color: #006699;">th</span>&gt;Subtotal:&lt;/<span style="color: #006699;">th</span>&gt;
<span class="linenr"> 7: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"subtotalEdit"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 8: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr"> 9: </span>  &lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">10: </span>    &lt;<span style="color: #006699;">th</span>&gt;Tax:&lt;/<span style="color: #006699;">th</span>&gt;
<span class="linenr">11: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"taxEdit"</span>/&gt;%&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">12: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr">13: </span>  &lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">14: </span>    &lt;<span style="color: #006699;">th</span>&gt;Total:&lt;/<span style="color: #006699;">th</span>&gt;
<span class="linenr">15: </span>    &lt;<span style="color: #006699;">td</span>&gt;$&lt;<span style="color: #006699;">span</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"totalSpan"</span>&gt;&lt;/<span style="color: #006699;">span</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">16: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr">17: </span>&lt;/<span style="color: #006699;">table</span>&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>View-Model</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Define the context</span>
<span class="linenr"> 2: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">context</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ContextBuilder</span>()
<span class="linenr"> 3: </span>    .v( <span style="color: #008000;">'subtotal'</span>, 39.99 )
<span class="linenr"> 4: </span>    .v( <span style="color: #008000;">'tax'</span>, 8 )
<span class="linenr"> 5: </span>    .v( <span style="color: #008000;">'total'</span> )
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    .c( <span style="color: #008000;">'subtotal, tax, total'</span> )
<span class="linenr"> 8: </span>    .m( <span style="color: #008000;">'subtotal, tax -&gt; total'</span>,
<span class="linenr"> 9: </span>        <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">subtotal</span>, <span style="color: #BA36A5;">tax</span> ) {
<span class="linenr">10: </span>          <span style="color: #0000FF;">return</span> Math.round( subtotal * (100+tax) ) / 100;
<span class="linenr">11: </span>        } )
<span class="linenr">12: </span>
<span class="linenr">13: </span>    .context();
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Create the constraint system</span>
<span class="linenr">16: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">pm</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.PropertyModel</span>();
<span class="linenr">17: </span>pm.addComponent( context );
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>Binding</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr"> 1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr"> 2: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'subtotalEdit'</span> ) ),
<span class="linenr"> 3: </span>            model:   context.subtotal,
<span class="linenr"> 4: </span>            toModel: [hd.toNum(), hd.round( 2 )],
<span class="linenr"> 5: </span>            toView:  hd.fix( 2 )
<span class="linenr"> 6: </span>           }
<span class="linenr"> 7: </span>         );
<span class="linenr"> 8: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'taxEdit'</span> ) ),
<span class="linenr"> 9: </span>            model:   context.tax,
<span class="linenr">10: </span>            toModel: [hd.toNum(), hd.round( 0 )],
<span class="linenr">11: </span>            toView:  hd.fix( 0 )
<span class="linenr">12: </span>           }
<span class="linenr">13: </span>         );
<span class="linenr">14: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Text</span>( document.getElementById( <span style="color: #008000;">'totalSpan'</span> ) ),
<span class="linenr">15: </span>            model:   context.total,
<span class="linenr">16: </span>            toModel: hd.fix( 2 )
<span class="linenr">17: </span>           }
<span class="linenr">18: </span>         );
<span class="linenr">19: </span>} );
</pre>
</div>
</div>
</div>
