docs/howto/basics.org
** Translator factories

Just as HotDrink provides several common adapter types, so too it provides
several common translator types.  While it is possible to create instances of
these types yourself using the =new= operator, HotDrink provides factory
functions for creating new instances of these translator types.  We describe
these functions in detail in the [[file:binding.org][Advanced Binding Concepts]] how-to.  For now,
however, we introduce three translators for use in the remainder of this
how-to.

The ~hd.toNum~ factory function creates a translator that converts a string to
a number, just like the translators created in the previous example.

#+BEGIN_SRC js
  // Using built-in translator
  var toNumTranslator = hd.toNum();
#+END_SRC

The ~hd.fix~ factory function creates a translator that converts a number to a
string.  This factory function takes a parameter indicating how many digits
should be present after the decimal point.

#+BEGIN_SRC js
  // Using built-in translator
  var fix2Translator = hd.fix( 2 );
#+END_SRC

Note that using a ~hd.fix~ translator only modifies how the value is /seen/ by
the View; it does not change the value in the View-Model.  For example, if a
variable was connected to an ~Edit~ adapter using the above translator, the
user could enter as many digits of precision as he desired; the extra digits
would be stored in the View-Model, but would not be displayed by the View.

We can improve this scheme by changing the value which is given to the
View-Model using the ~hd.round~ translator.  This translator takes a number
and rounds it to a certain number of digits of precision.

#+BEGIN_SRC js
  // A rounding translator
  var roundTranslator = hd.round( 2 );
#+END_SRC

Note that this translator does /not/ change the data-type of a value; instead
it modifies the value.  If a change in data-type is required, this translator
can be used in conjunction with another, such as ~hd.toNum~.  We demonstrate
this below.


** Binding descriptions

The function ~hd.bind~ takes a single parameter: an object referred to as the
/binding description/.  A binding description is any object which has the
following four properties:

- ~view~ :: observable/observer representing a value of the View
- ~model~ :: observable/observer representing a value of the View-Model
- ~toView~ :: translator(s) for going from View-Model to View
- ~toModel~ :: translator(s) for going from View to View-Model

The ~toView~ and ~toModel~ properties are optional; the only required
properties are ~view~ and ~model~.  If present, the ~toView~ and ~toModel~
properties should hold either a single translator, or an array of
translators.  Consider, for example, the binding description in the following
call to ~hd.bind~.

#+NAME: binding-description
#+BEGIN_SRC js
  hd.bind( {view:    new hd.Edit( document.getElementById( 'subtotalEdit' ) ),
            model:   context.subtotal,
            toModel: [hd.toNum(), hd.round( 2 )],
            toView:  hd.fix( 2 )
           }
         );
#+END_SRC

Here, the /view/ object is an ~Edit~ view adapter, and the /model/ object is
the =subtotal= variable.  When going from the View to the View-Model, we first
translate the string to a number, then round the number to two digits.  Going
the other way, we convert the number to a fixed-point string with two digits
of precision.

* Multi-way constraints

Constraints in HotDrink can be solved in multiple directions.  For example,
given the constraint $width=right-left$, we could solve for any one of the
three variables using the values of the other two.  To create a multi-way
constraint, we simply provide one method for each way the constraint can be
solved.

In general, HotDrink tries to preserve the values the user has entered most
recently.  Thus, when given a choice of how to solve a constraint, HotDrink
will look for the method which updates the /least/ recently edited variable.

