howto/basics.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Translator factories</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Just as HotDrink provides several common adapter types, so too it provides
several common translator types.  While it is possible to create instances of
these types yourself using the <code>new</code> operator, HotDrink provides factory
functions for creating new instances of these translator types.  We describe
these functions in detail in the <a href="binding.html">Advanced Binding Concepts</a> how-to.  For now,
however, we introduce three translators for use in the remainder of this
how-to.
</p>

<p>
The <code>hd.toNum</code> factory function creates a translator that converts a string to
a number, just like the translators created in the previous example.
</p>

<div class="org-src-container">

<pre class="src src-js">  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Using built-in translator</span>
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">toNumTranslator</span> = hd.toNum();
</pre>
</div>

<p>
The <code>hd.fix</code> factory function creates a translator that converts a number to a
string.  This factory function takes a parameter indicating how many digits
should be present after the decimal point.
</p>

<div class="org-src-container">

<pre class="src src-js">  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Using built-in translator</span>
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">fix2Translator</span> = hd.fix( 2 );
</pre>
</div>

<p>
Note that using a <code>hd.fix</code> translator only modifies how the value is <i>seen</i> by
the View; it does not change the value in the View-Model.  For example, if a
variable was connected to an <code>Edit</code> adapter using the above translator, the
user could enter as many digits of precision as he desired; the extra digits
would be stored in the View-Model, but would not be displayed by the View.
</p>

<p>
We can improve this scheme by changing the value which is given to the
View-Model using the <code>hd.round</code> translator.  This translator takes a number
and rounds it to a certain number of digits of precision.
</p>

<div class="org-src-container">

<pre class="src src-js">  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">A rounding translator</span>
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">roundTranslator</span> = hd.round( 2 );
</pre>
</div>

<p>
Note that this translator does <i>not</i> change the data-type of a value; instead
it modifies the value.  If a change in data-type is required, this translator
can be used in conjunction with another, such as <code>hd.toNum</code>.  We demonstrate
this below.
</p>
</div>
</div>


<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Binding descriptions</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The function <code>hd.bind</code> takes a single parameter: an object referred to as the
<i>binding description</i>.  A binding description is any object which has the
following four properties:
</p>

<dl class="org-dl">
<dt><code>view</code></dt><dd>observable/observer representing a value of the View
</dd>
<dt><code>model</code></dt><dd>observable/observer representing a value of the View-Model
</dd>
<dt><code>toView</code></dt><dd>translator(s) for going from View-Model to View
</dd>
<dt><code>toModel</code></dt><dd>translator(s) for going from View to View-Model
</dd>
</dl>

<p>
The <code>toView</code> and <code>toModel</code> properties are optional; the only required
properties are <code>view</code> and <code>model</code>.  If present, the <code>toView</code> and <code>toModel</code>
properties should hold either a single translator, or an array of
translators.  Consider, for example, the binding description in the following
call to <code>hd.bind</code>.
</p>

<div class="org-src-container">

<pre class="src src-js" id="binding-description">  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'subtotalEdit'</span> ) ),
            model:   context.subtotal,
            toModel: [hd.toNum(), hd.round( 2 )],
            toView:  hd.fix( 2 )
           }
         );
</pre>
</div>

<p>
Here, the <i>view</i> object is an <code>Edit</code> view adapter, and the <i>model</i> object is
the <code>subtotal</code> variable.  When going from the View to the View-Model, we first
translate the string to a number, then round the number to two digits.  Going
the other way, we convert the number to a fixed-point string with two digits
of precision.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Multi-way constraints</h2>
<div class="outline-text-2" id="text-6">
<p>
Constraints in HotDrink can be solved in multiple directions.  For example,
given the constraint \(width=right-left\), we could solve for any one of the
three variables using the values of the other two.  To create a multi-way
constraint, we simply provide one method for each way the constraint can be
solved.
</p>

<p>
In general, HotDrink tries to preserve the values the user has entered most
recently.  Thus, when given a choice of how to solve a constraint, HotDrink
will look for the method which updates the <i>least</i> recently edited variable.
</p>
</div>
