docs/howto/basics.org
** Updating the constraint system

Whenever you modify any of the variables of the property model, HotDrink
assumes any constraints which use those variables are no longer satisfied.  It
then performs two tasks.  The first is to decide which variable (or variables)
should be updated.  The second is to use a method (or methods) you provided to
calculate a new value for that variable (or variables).

Deciding which variables to update is not a trivial task.  Consider the
following scenario:  the variable ~left~ is modified, so HotDrink decides to
update the ~width~ variable so that ~width == right - left~.  But now the
constraint ~aspect == width / height~ is no longer satisfied, so HotDrink must
update one of those variables as well.  Thus, the effects of a single edit can
cascade to multiple variables.  HotDrink must consider the entire constraint
system and decide which variables will be used to update which other
variables.  This plan for updating is called a /dataflow/.

Often there is more than one possible dataflow which could work.  In this
case, HotDrink will /generally/ select the dataflow which preserves variables
that have been more recently edited by the user.  (In certain unusual cases
the behavior is slightly more complicated, but this rule of thumb is close
enough for now.)  We believe this is generally what the user wants, as the
values more recently edited are more likely to reflect the user's current
intent.

** Declaring multiple variables at once

This example uses the ~variables~ function of the context builder to declare
multiple variables at once.  This function takes two parameters.  The first is
a string containing a comma-delimited list of variables to create.  The second
is an object used as a map to provide initial values for variables.  If a
variable does not contain an entry in the map, it is treated as uninitialized,
and therefore given the value ~undefined~.

#+NAME: variables
#+BEGIN_SRC js
  .variables( 'left, right, width, top, bottom, height, aspect',
              {left: 0, right: 100, top: 60, bottom: 140}
  )
#+END_SRC

Note that the variables are created in the order in which they appear in the
string.  This is significant as the order in which variables are created
determines the initial editing order for the variables, and thus affects the
initial dataflow selected by the system.  Initializing a variable is treated
as an edit; creating an uninitialized variable is not treated as an edit.
Thus, the system will initially pick a dataflow that writes to uninitialized
variables; If any initialized variables need to be overwritten, the system
will choose to overwrite the variables created /earlier/, since those will be
considered less-recently edited.

The ~variables~ member function returns the builder.  The abbreviation for
~variables~ is ~vs~; we will use this abbreviation in the remainder of the
examples.

** Reusing functions

Notice that we can reuse the same function for multiple methods.  In this
example, we defined four simple mathematical functions at the top, then simply
used the appropriate function for each method.  Again, the values passed as
arguments will come from the variables specified in the signature.

In fact, if your constraints really are trivial equations such as this, there
is an even easier way to specify them.  We'll discuss that in the section
"[[* Shortcut: equations][Shortcut: equations]]".

* Input/output variables

When solving the constraint system, HotDrink must ensure that any variables
needing to be updated are given a new value before they are read by any
methods.  This creates a challenge for methods that want to look at the old
value of a variable as they update it.  Fortunately, HotDrink has a method of
providing the previous value of a variable to a method.

