howto/basics.html


<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Updating the constraint system</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Whenever you modify any of the variables of the property model, HotDrink
assumes any constraints which use those variables are no longer satisfied.  It
then performs two tasks.  The first is to decide which variable (or variables)
should be updated.  The second is to use a method (or methods) you provided to
calculate a new value for that variable (or variables).
</p>

<p>
Deciding which variables to update is not a trivial task.  Consider the
following scenario:  the variable <code>left</code> is modified, so HotDrink decides to
update the <code>width</code> variable so that <code>width == right - left</code>.  But now the
constraint <code>aspect == width / height</code> is no longer satisfied, so HotDrink must
update one of those variables as well.  Thus, the effects of a single edit can
cascade to multiple variables.  HotDrink must consider the entire constraint
system and decide which variables will be used to update which other
variables.  This plan for updating is called a <i>dataflow</i>.
</p>

<p>
Often there is more than one possible dataflow which could work.  In this
case, HotDrink will <i>generally</i> select the dataflow which preserves variables
that have been more recently edited by the user.  (In certain unusual cases
the behavior is slightly more complicated, but this rule of thumb is close
enough for now.)  We believe this is generally what the user wants, as the
values more recently edited are more likely to reflect the user's current
intent.
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Declaring multiple variables at once</h3>
<div class="outline-text-3" id="text-6-3">
<p>
This example uses the <code>variables</code> function of the context builder to declare
multiple variables at once.  This function takes two parameters.  The first is
a string containing a comma-delimited list of variables to create.  The second
is an object used as a map to provide initial values for variables.  If a
variable does not contain an entry in the map, it is treated as uninitialized,
and therefore given the value <code>undefined</code>.
</p>

<div class="org-src-container">

<pre class="src src-js" id="variables">  .variables( <span style="color: #008000;">'left, right, width, top, bottom, height, aspect'</span>,
              {left: 0, right: 100, top: 60, bottom: 140}
  )
</pre>
</div>

<p>
Note that the variables are created in the order in which they appear in the
string.  This is significant as the order in which variables are created
determines the initial editing order for the variables, and thus affects the
initial dataflow selected by the system.  Initializing a variable is treated
as an edit; creating an uninitialized variable is not treated as an edit.
Thus, the system will initially pick a dataflow that writes to uninitialized
variables; If any initialized variables need to be overwritten, the system
will choose to overwrite the variables created <i>earlier</i>, since those will be
considered less-recently edited.
</p>

<p>
The <code>variables</code> member function returns the builder.  The abbreviation for
<code>variables</code> is <code>vs</code>; we will use this abbreviation in the remainder of the
examples.
</p>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Reusing functions</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Notice that we can reuse the same function for multiple methods.  In this
example, we defined four simple mathematical functions at the top, then simply
used the appropriate function for each method.  Again, the values passed as
arguments will come from the variables specified in the signature.
</p>

<p>
In fact, if your constraints really are trivial equations such as this, there
is an even easier way to specify them.  We'll discuss that in the section
"<a href="#sec-11">Shortcut: equations</a>".
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Input/output variables</h2>
<div class="outline-text-2" id="text-7">
<p>
When solving the constraint system, HotDrink must ensure that any variables
needing to be updated are given a new value before they are read by any
methods.  This creates a challenge for methods that want to look at the old
value of a variable as they update it.  Fortunately, HotDrink has a method of
providing the previous value of a variable to a method.
</p>
</div>
