docs/howto/basics.org
** The example

The constraint here is actually an inequality: $begin\le{}end+1$.  If you set one
variable so that the inequality holds, then the other variable is not
modified.  However, if you make the inequality false, then the other variable
is changed just enough to make it true.

#+HTML: <div class="results">
#+INCLUDE: tangle/io-param.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/io-param.js html
#+HTML: })();
#+HTML: </script>

*Source Code*

#+CAPTION: /View/ (show/hide)
#+BEGIN_SRC html -n :exports code :tangle tangle/io-param.html :padline no
<div style="display:inline-block; text-align:right">
  Begin: <input type="text" id="begin"/><br/>
  End:   <input type="text" id="end"/>
</div>
#+END_SRC

#+CAPTION: /View-Model/ (show/hide)
#+BEGIN_SRC js -n :exports code :tangle tangle/io-param.js :padline no :noweb yes
var context = new hd.ContextBuilder()
  .v( 'begin', 10 ).v( 'end', 20 )

   // Constraint: begin < end
  .c( 'begin, end' )
<<previous>>
  .m( '!begin, end -> begin',
      function( begin, end ) {
        return begin > end - 1 ? end - 1 : begin;
      } )

  .context();

var pm = new hd.PropertyModel;
pm.addComponent( context );
#+END_SRC

#+CAPTION: /Binding/ (show/hide)
#+BEGIN_SRC js -n :exports code :tangle tangle/io-param.js :padline no
window.addEventListener( 'load', function() {
  hd.bind( {view:    new hd.Edit( document.getElementById( 'begin' ) ),
            model:   context.begin,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'end' ) ),
            model:   context.end,
            toModel: hd.toNum()
           }
         );
} );
#+END_SRC

#+HTML: <div class="notes">
#+HTML: </div>

** Previous variable values

Technically a method cannot use the same variable as input and output: it
would require the method to produce its output before it read its parameters.
However, we allow a method to access the /previous/ value of a variable---the
value it had before we began solving the constraint system.

In fact, a method may access the previous value of /any/ variable, not just
its outputs.  For this reason, when a method wants the previous value of a
variable as an input, we require that it be indicated in the method's
signature.  This is done by putting an exclamation point ("!") in front of the
variable name.  For example, the following method uses the previous value of
~begin~ and the updated value of ~end~ to calculate the updated value of
~begin~.

#+NAME: previous
#+BEGIN_SRC js
  .m( 'begin, !end -> end',
      function( begin, end ) {
        return end < begin + 1 ? begin + 1 : end;
      } )
#+END_SRC

** Caveat

In general, it is unwise to make assumptions about when HotDrink will run your
method, including how often your method will be run.  Thus, you should avoid
methods like the following.

#+BEGIN_SRC js
.m( "!n, x -> n",
    function( n ) {
      return n + x;
    } )
#+END_SRC

Such a method may lead to poorly defined behavior, since its effect depends on
how frequently it is run.  Furthermore, it is unclear what constraint such a
method enforces; the relation $n=n+x$ seems nonsensical.

If you need some sort of incremental behavior, it is better to use a separate
variable to represent the increment since the previous iteration.  For
example, one might use a variable $t$ to represent time.  Then we could write
the method as follows:

#+BEGIN_SRC js
.method( "!t, t, !n, x -> n", function( t1, t2, n, x ) {
  return n + (t2 - t1)*x;
}
#+END_SRC

Such a method would define $n$ as the integral of $x$ over $t$.  Each change
in $t$ would cause the method to update the value of $n$ accordingly.

* Multiple output variables

In many cases it is desirable to have a method with multiple output variables.
Of course, a function can only return a single value; however, we allow that
value to be an array.  The different elements of that array can then be
assigned to variables by pattern matching against the signature.

