howto/basics.html

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> The example</h3>
<div class="outline-text-3" id="text-7-1">
<p>
The constraint here is actually an inequality: \(begin\le{}end+1\).  If you set one
variable so that the inequality holds, then the other variable is not
modified.  However, if you make the inequality false, then the other variable
is changed just enough to make it true.
</p>

<div class="results">
<div style="display:inline-block; text-align:right">
  Begin: <input type="text" id="begin"/><br/>
  End:   <input type="text" id="end"/>
</div>
</div>
<script type="text/javascript">
(function() {
var context = new hd.ContextBuilder()
  .v( 'begin', 10 ).v( 'end', 20 )

   // Constraint: begin < end
  .c( 'begin, end' )
  .m( 'begin, !end -> end',
      function( begin, end ) {
        return end < begin + 1 ? begin + 1 : end;
      } )
  .m( '!begin, end -> begin',
      function( begin, end ) {
        return begin > end - 1 ? end - 1 : begin;
      } )

  .context();

var pm = new hd.PropertyModel;
pm.addComponent( context );
window.addEventListener( 'load', function() {
  hd.bind( {view:    new hd.Edit( document.getElementById( 'begin' ) ),
            model:   context.begin,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'end' ) ),
            model:   context.end,
            toModel: hd.toNum()
           }
         );
} );
})();
</script>

<p>
<b>Source Code</b>
</p>

<div class="org-src-container">
<label class="org-src-name"><i>View</i> (show/hide)</label>
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"display:inline-block; text-align:right"</span>&gt;
<span class="linenr">2: </span>  Begin: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"begin"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">3: </span>  End:   &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"end"</span>/&gt;
<span class="linenr">4: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>View-Model</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">context</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ContextBuilder</span>()
<span class="linenr"> 2: </span>  .v( <span style="color: #008000;">'begin'</span>, 10 ).v( <span style="color: #008000;">'end'</span>, 20 )
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Constraint: begin &lt; end</span>
<span class="linenr"> 5: </span>  .c( <span style="color: #008000;">'begin, end'</span> )
<span class="linenr"> 6: </span>  .m( <span style="color: #008000;">'begin, !end -&gt; end'</span>,
<span class="linenr"> 7: </span>      <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">begin</span>, <span style="color: #BA36A5;">end</span> ) {
<span class="linenr"> 8: </span>        <span style="color: #0000FF;">return</span> end &lt; begin + 1 ? begin + 1 : end;
<span class="linenr"> 9: </span>      } )
<span class="linenr">10: </span>  .m( <span style="color: #008000;">'!begin, end -&gt; begin'</span>,
<span class="linenr">11: </span>      <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">begin</span>, <span style="color: #BA36A5;">end</span> ) {
<span class="linenr">12: </span>        <span style="color: #0000FF;">return</span> begin &gt; end - 1 ? end - 1 : begin;
<span class="linenr">13: </span>      } )
<span class="linenr">14: </span>
<span class="linenr">15: </span>  .context();
<span class="linenr">16: </span>
<span class="linenr">17: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">pm</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.PropertyModel</span>;
<span class="linenr">18: </span>pm.addComponent( context );
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>Binding</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr"> 1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr"> 2: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'begin'</span> ) ),
<span class="linenr"> 3: </span>            model:   context.begin,
<span class="linenr"> 4: </span>            toModel: hd.toNum()
<span class="linenr"> 5: </span>           }
<span class="linenr"> 6: </span>         );
<span class="linenr"> 7: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'end'</span> ) ),
<span class="linenr"> 8: </span>            model:   context.end,
<span class="linenr"> 9: </span>            toModel: hd.toNum()
<span class="linenr">10: </span>           }
<span class="linenr">11: </span>         );
<span class="linenr">12: </span>} );
</pre>
</div>

<div class="notes">
</div>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Previous variable values</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Technically a method cannot use the same variable as input and output: it
would require the method to produce its output before it read its parameters.
However, we allow a method to access the <i>previous</i> value of a variable&#x2014;the
value it had before we began solving the constraint system.
</p>

<p>
In fact, a method may access the previous value of <i>any</i> variable, not just
its outputs.  For this reason, when a method wants the previous value of a
variable as an input, we require that it be indicated in the method's
signature.  This is done by putting an exclamation point ("!") in front of the
variable name.  For example, the following method uses the previous value of
<code>begin</code> and the updated value of <code>end</code> to calculate the updated value of
<code>begin</code>.
</p>

<div class="org-src-container">

<pre class="src src-js" id="previous">  .m( <span style="color: #008000;">'begin, !end -&gt; end'</span>,
      <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">begin</span>, <span style="color: #BA36A5;">end</span> ) {
        <span style="color: #0000FF;">return</span> end &lt; begin + 1 ? begin + 1 : end;
      } )
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Caveat</h3>
<div class="outline-text-3" id="text-7-3">
<p>
In general, it is unwise to make assumptions about when HotDrink will run your
method, including how often your method will be run.  Thus, you should avoid
methods like the following.
</p>

<div class="org-src-container">

<pre class="src src-js">.m( <span style="color: #008000;">"!n, x -&gt; n"</span>,
    <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">n</span> ) {
      <span style="color: #0000FF;">return</span> n + x;
    } )
</pre>
</div>

<p>
Such a method may lead to poorly defined behavior, since its effect depends on
how frequently it is run.  Furthermore, it is unclear what constraint such a
method enforces; the relation \(n=n+x\) seems nonsensical.
</p>

<p>
If you need some sort of incremental behavior, it is better to use a separate
variable to represent the increment since the previous iteration.  For
example, one might use a variable \(t\) to represent time.  Then we could write
the method as follows:
</p>

<div class="org-src-container">

<pre class="src src-js">.method( <span style="color: #008000;">"!t, t, !n, x -&gt; n"</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">t1</span>, <span style="color: #BA36A5;">t2</span>, <span style="color: #BA36A5;">n</span>, <span style="color: #BA36A5;">x</span> ) {
  <span style="color: #0000FF;">return</span> n + (t2 - t1)*x;
}
</pre>
</div>

<p>
Such a method would define \(n\) as the integral of \(x\) over \(t\).  Each change
in \(t\) would cause the method to update the value of \(n\) accordingly.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Multiple output variables</h2>
<div class="outline-text-2" id="text-8">
<p>
In many cases it is desirable to have a method with multiple output variables.
Of course, a function can only return a single value; however, we allow that
value to be an array.  The different elements of that array can then be
assigned to variables by pattern matching against the signature.
</p>
</div>
