docs/howto/basics.org
** The example

This is a straightforward constraint: the value for the year is the sum of the
values for the four quarters.  However, data can only flow two ways in this
constraint.  If any one of the quarters is modified, then the year is updated.
If the year is modified, then we take the difference and distribute it evenly
among the four quarters, thus satisfying the constraint.

#+HTML: <div class="results">
#+INCLUDE: tangle/multi-out.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/multi-out.js html
#+HTML: })();
#+HTML: </script>

*Source Code*

#+CAPTION: /View/ (show/hide)
#+BEGIN_SRC html -n :exports code :tangle tangle/multi-out.html :padline no
<div style="display:inline-block; text-align:right">
  First Quarter:  <input type="text" id="q1"/><br/>
  Second Quarter: <input type="text" id="q2"/><br/>
  Third Quarter:  <input type="text" id="q3"/><br/>
  Fourth Quarter: <input type="text" id="q4"/><br/>
  <hr/>
  Full Year:      <input type="text" id="year"/><br/>
</div>
#+END_SRC

#+CAPTION: /View/ (show/hide)
#+BEGIN_SRC js -n :exports code :tangle tangle/multi-out.js :padline no :noweb yes
var context = new hd.ContextBuilder()
  .vs( 'q1, q2, q3, q4, year', {q1: 10, q2: 30, q3: 60, q4: 100} )

  .c( 'q1, q2, q3, q4, year' )
<<multiout>>

  .context();

var pm = new hd.PropertyModel();
pm.addComponent( context );
#+END_SRC

#+CAPTION: /Binding/ (show/hide)
#+BEGIN_SRC js -n :exports code :tangle tangle/multi-out.js :padline no
window.addEventListener( 'load', function() {
  hd.bind( {view:    new hd.Edit( document.getElementById( 'q1' ) ),
            model:   context.q1,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'q2' ) ),
            model:   context.q2,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'q3' ) ),
            model:   context.q3,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'q4' ) ),
            model:   context.q4,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'year' ) ),
            model:   context.year,
            toModel: hd.toNum()
           }
         );
} );
#+END_SRC

** Multiple return values

The signature of the following method designates that it will return an array,
and that the elements of that array are the values of =q1=, =q2=, =q3=, and
=q4= respectively.  When the value is returned, it is matched against the
signature, and values are assigned to the corresponding variables.

#+NAME: multiout
#+BEGIN_SRC js
  .m( 'year, !q1, !q2, !q3, !q4 -> q1, q2, q3, q4',
      function( year, q1, q2, q3, q4 ) {
        var diff = (year - q1 - q2 - q3 - q4) / 4;
        return [q1 + diff, q2 + diff, q3 + diff, q4 + diff ];
      }
  )
#+END_SRC

Note that this form of pattern matching works for inputs as well.  For
example, we could indicate that we wanted to receive the old values of =p1=,
=p2=, =p3=, and =p4= as an array, like so.

#+BEGIN_SRC js
  .m( 'year, [!q1, !q2, !q3, !q4] -> [q1, q2, q3, q4]',
      function( year, qs ) {
        var diff = (year - qs[0] - qs[1] - qs[2] - qs[3]) / 4;
        return qs.map( function( qi ) { return qi + diff; }
      }
  )
#+END_SRC

* Declarative binding

We return to the topic of binding, this time to see how we may embed binding
specifications into tags.  Doing so allows us to iterate over the DOM and
automatically perform any bindings we encounter.

