howto/basics.html

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> The example</h3>
<div class="outline-text-3" id="text-8-1">
<p>
This is a straightforward constraint: the value for the year is the sum of the
values for the four quarters.  However, data can only flow two ways in this
constraint.  If any one of the quarters is modified, then the year is updated.
If the year is modified, then we take the difference and distribute it evenly
among the four quarters, thus satisfying the constraint.
</p>

<div class="results">
<div style="display:inline-block; text-align:right">
  First Quarter:  <input type="text" id="q1"/><br/>
  Second Quarter: <input type="text" id="q2"/><br/>
  Third Quarter:  <input type="text" id="q3"/><br/>
  Fourth Quarter: <input type="text" id="q4"/><br/>
  <hr/>
  Full Year:      <input type="text" id="year"/><br/>
</div>
</div>
<script type="text/javascript">
(function() {
var context = new hd.ContextBuilder()
  .vs( 'q1, q2, q3, q4, year', {q1: 10, q2: 30, q3: 60, q4: 100} )

  .c( 'q1, q2, q3, q4, year' )
  .m( 'year, !q1, !q2, !q3, !q4 -> q1, q2, q3, q4',
      function( year, q1, q2, q3, q4 ) {
        var diff = (year - q1 - q2 - q3 - q4) / 4;
        return [q1 + diff, q2 + diff, q3 + diff, q4 + diff ];
      }
  )

  .context();

var pm = new hd.PropertyModel();
pm.addComponent( context );
window.addEventListener( 'load', function() {
  hd.bind( {view:    new hd.Edit( document.getElementById( 'q1' ) ),
            model:   context.q1,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'q2' ) ),
            model:   context.q2,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'q3' ) ),
            model:   context.q3,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'q4' ) ),
            model:   context.q4,
            toModel: hd.toNum()
           }
         );
  hd.bind( {view:    new hd.Edit( document.getElementById( 'year' ) ),
            model:   context.year,
            toModel: hd.toNum()
           }
         );
} );
})();
</script>

<p>
<b>Source Code</b>
</p>

<div class="org-src-container">
<label class="org-src-name"><i>View</i> (show/hide)</label>
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"display:inline-block; text-align:right"</span>&gt;
<span class="linenr">2: </span>  First Quarter:  &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"q1"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">3: </span>  Second Quarter: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"q2"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">4: </span>  Third Quarter:  &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"q3"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">5: </span>  Fourth Quarter: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"q4"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">6: </span>  &lt;<span style="color: #006699;">hr</span>/&gt;
<span class="linenr">7: </span>  Full Year:      &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"year"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">8: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>View</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">context</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ContextBuilder</span>()
<span class="linenr"> 2: </span>  .vs( <span style="color: #008000;">'q1, q2, q3, q4, year'</span>, {q1: 10, q2: 30, q3: 60, q4: 100} )
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  .c( <span style="color: #008000;">'q1, q2, q3, q4, year'</span> )
<span class="linenr"> 5: </span>  .m( <span style="color: #008000;">'year, !q1, !q2, !q3, !q4 -&gt; q1, q2, q3, q4'</span>,
<span class="linenr"> 6: </span>      <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">year</span>, <span style="color: #BA36A5;">q1</span>, <span style="color: #BA36A5;">q2</span>, <span style="color: #BA36A5;">q3</span>, <span style="color: #BA36A5;">q4</span> ) {
<span class="linenr"> 7: </span>        <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">diff</span> = (year - q1 - q2 - q3 - q4) / 4;
<span class="linenr"> 8: </span>        <span style="color: #0000FF;">return</span> [q1 + diff, q2 + diff, q3 + diff, q4 + diff ];
<span class="linenr"> 9: </span>      }
<span class="linenr">10: </span>  )
<span class="linenr">11: </span>
<span class="linenr">12: </span>  .context();
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">pm</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.PropertyModel</span>();
<span class="linenr">15: </span>pm.addComponent( context );
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>Binding</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr"> 1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr"> 2: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'q1'</span> ) ),
<span class="linenr"> 3: </span>            model:   context.q1,
<span class="linenr"> 4: </span>            toModel: hd.toNum()
<span class="linenr"> 5: </span>           }
<span class="linenr"> 6: </span>         );
<span class="linenr"> 7: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'q2'</span> ) ),
<span class="linenr"> 8: </span>            model:   context.q2,
<span class="linenr"> 9: </span>            toModel: hd.toNum()
<span class="linenr">10: </span>           }
<span class="linenr">11: </span>         );
<span class="linenr">12: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'q3'</span> ) ),
<span class="linenr">13: </span>            model:   context.q3,
<span class="linenr">14: </span>            toModel: hd.toNum()
<span class="linenr">15: </span>           }
<span class="linenr">16: </span>         );
<span class="linenr">17: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'q4'</span> ) ),
<span class="linenr">18: </span>            model:   context.q4,
<span class="linenr">19: </span>            toModel: hd.toNum()
<span class="linenr">20: </span>           }
<span class="linenr">21: </span>         );
<span class="linenr">22: </span>  hd.bind( {view:    <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'year'</span> ) ),
<span class="linenr">23: </span>            model:   context.year,
<span class="linenr">24: </span>            toModel: hd.toNum()
<span class="linenr">25: </span>           }
<span class="linenr">26: </span>         );
<span class="linenr">27: </span>} );
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Multiple return values</h3>
<div class="outline-text-3" id="text-8-2">
<p>
The signature of the following method designates that it will return an array,
and that the elements of that array are the values of <code>q1</code>, <code>q2</code>, <code>q3</code>, and
<code>q4</code> respectively.  When the value is returned, it is matched against the
signature, and values are assigned to the corresponding variables.
</p>

<div class="org-src-container">

<pre class="src src-js" id="multiout">  .m( <span style="color: #008000;">'year, !q1, !q2, !q3, !q4 -&gt; q1, q2, q3, q4'</span>,
      <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">year</span>, <span style="color: #BA36A5;">q1</span>, <span style="color: #BA36A5;">q2</span>, <span style="color: #BA36A5;">q3</span>, <span style="color: #BA36A5;">q4</span> ) {
        <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">diff</span> = (year - q1 - q2 - q3 - q4) / 4;
        <span style="color: #0000FF;">return</span> [q1 + diff, q2 + diff, q3 + diff, q4 + diff ];
      }
  )
</pre>
</div>

<p>
Note that this form of pattern matching works for inputs as well.  For
example, we could indicate that we wanted to receive the old values of <code>p1</code>,
<code>p2</code>, <code>p3</code>, and <code>p4</code> as an array, like so.
</p>

<div class="org-src-container">

<pre class="src src-js">  .m( <span style="color: #008000;">'year, [!q1, !q2, !q3, !q4] -&gt; [q1, q2, q3, q4]'</span>,
      <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">year</span>, <span style="color: #BA36A5;">qs</span> ) {
        <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">diff</span> = (year - qs[0] - qs[1] - qs[2] - qs[3]) / 4;
        <span style="color: #0000FF;">return</span> qs.map( <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">qi</span> ) { <span style="color: #0000FF;">return</span> qi + diff; }
      }
  )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Declarative binding</h2>
<div class="outline-text-2" id="text-9">
<p>
We return to the topic of binding, this time to see how we may embed binding
specifications into tags.  Doing so allows us to iterate over the DOM and
automatically perform any bindings we encounter.
</p>
</div>
