howto/basics.html

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> The example</h3>
<div class="outline-text-3" id="text-9-1">
<p>
This example uses no constraints; it simply illustrates a new binding
technique.  Editing the text boxes modifies the value displayed to the right.
</p>

<div class="results">
<div id="ex6">
  X: <input type="text" data-bind="{mkview: hd.Edit, model: x}"/>
           &rArr; <span data-bind="{mkview: hd.Text, model: x}"></span><br/>
  Y: <input type="text" data-bind="{mkview: hd.Edit, model: y, toModel: hd.toNum()}"/>
           &rArr; <span data-bind="{mkview: hd.Text, model: y}"></span>
</div>
</div>
<script type="text/javascript">
(function() {
var context = new hd.ContextBuilder()
    .v( 'x', 'Hello, again!' ).v( 'y', 3 ).context();

var pm = new hd.PropertyModel();
pm.addComponent( context );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( context, document.getElementById( 'ex6' ) );
} );
})();
</script>

<p>
<b>Source code</b>
</p>

<div class="org-src-container">
<label class="org-src-name"><i>View</i> (show/hide)</label>
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex6"</span>&gt;
<span class="linenr">2: </span>  X: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"{mkview: hd.Edit, model: x}"</span>/&gt;
<span class="linenr">3: </span>           <span style="color: #BA36A5;">&amp;rArr;</span> &lt;<span style="color: #006699;">span</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"{mkview: hd.Text, model: x}"</span>&gt;&lt;/<span style="color: #006699;">span</span>&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">4: </span>  Y: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"{mkview: hd.Edit, model: y, toModel: hd.toNum()}"</span>/&gt;
<span class="linenr">5: </span>           <span style="color: #BA36A5;">&amp;rArr;</span> &lt;<span style="color: #006699;">span</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"{mkview: hd.Text, model: y}"</span>&gt;&lt;/<span style="color: #006699;">span</span>&gt;
<span class="linenr">6: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>View-Model</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">context</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ContextBuilder</span>()
<span class="linenr">2: </span>    .v( <span style="color: #008000;">'x'</span>, <span style="color: #008000;">'Hello, again!'</span> ).v( <span style="color: #008000;">'y'</span>, 3 ).context();
<span class="linenr">3: </span>
<span class="linenr">4: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">pm</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.PropertyModel</span>();
<span class="linenr">5: </span>pm.addComponent( context );
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>Binding</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( context, document.getElementById( <span style="color: #008000;">'ex6'</span> ) );
<span class="linenr">3: </span>} );
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Automatic binding function</h3>
<div class="outline-text-3" id="text-9-2">
<p>
By now you've probably noticed that the binding section tends to be repetitive
and boring.  HotDrink offers two shortcuts to help alleviate this.  The first,
shown here, is allowing binding specifications to be embedded in the HTML.
There are two steps required for this.
</p>
</div>

<ol class="org-ol"><li><a id="sec-9-2-1"></a>Add binding specifications<br  /><div class="outline-text-4" id="text-9-2-1">
<p>
The first step is to add markup in the HTML to describe how elements should be
bound.  To indicate that you wish to bind a variable to the node for an HTML
tag, simply add a <code>data-bind</code> attribute to the tag with the code for the
binding specification.  At run-time, HotDrink will evaluate this attribute
string as JavaScript code to take the result as the binding specification
object.
</p>

<div class="org-src-container">

<pre class="src src-js" id="data-bind">  X: &lt;input type=<span style="color: #008000;">"text"</span> data-bind=<span style="color: #008000;">"{mkview: hd.Edit, model: x}"</span>/&gt;
</pre>
</div>

<p>
Note, however, one slight change to this binding specification.  In previous
examples our view object was a view adapter which encapsulated some DOM node
in the tree.  When you embed a binding specification in the HTML, HotDrink
assumes that a view adapter needs to be created for the DOM node.  Thus, it
looks for an attribute named "<code>mkview</code>".  This should be a constructor or
factory function which takes a single DOM node parameter.  HotDrink will use
this constructor or factory to create the view object, like so.
</p>

<div class="org-src-container">

<pre class="src src-js">specification.view = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">specification.mkview</span>( domNode );
</pre>
</div>

<p>
Also notice that, in the binding specification, you may refer to the variable
by it's name in the model.  For example, above we simply wrote <code>model: x</code>
instead of <code>model: context.x</code>.  When evaluating your binding specification,
HotDrink will first try to find any names in the context you provided to the
binding function (see below); if it cannot find it in the context, it will
treat the name as a global identifier.
</p>
</div>
</li>

<li><a id="sec-9-2-2"></a>Call the binding function<br  /><div class="outline-text-4" id="text-9-2-2">
<p>
The second step is to call the HotDrink function to performs the binding.  You
can do this as follows.
</p>

<div class="org-src-container">

<pre class="src src-js" id="bind">  hd.performDeclaredBindings( context, document.getElementById( <span style="color: #008000;">'ex6'</span> ) );
</pre>
</div>

<p>
This function takes two parameters: a model to use, and a DOM node at which to
start searching.  This function will search the DOM node passed to it and any
DOM nodes under it for elements with a <code>data-bind</code> attribute.  When it finds
one, it evaluate the binding specification as described above and then pass it
to <code>hd.bind</code>.
</p>

<p>
In the example above, HotDrink would examine all tags contained by the <code>&lt;div&gt;</code>
tag which has the id ="ex6"=.  It would evaluate the binding specifications
for each of the four tags with <code>data-bind</code> attributes.  Then it will attempt
to bind according to each of those specifications.
</p>

<p>
The second parameter is optional; it defaults to <code>document.body</code> so that the
entire document will be searched.  Note, however, that this could cause
problems if you are binding different models to different parts of the
document (for example, as we are in this document).
</p>

<p>
As with manual binding, you must ensure that the nodes involved have been
added to the DOM <i>before</i> calling <code>performDeclaredBindings</code>; therefore, it is
advised to use the <code>window.onload</code> event or some alternative method of
executing code after the DOM is fully ready.
</p>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Shortcut: binding specification factories</h2>
<div class="outline-text-2" id="text-10">
<p>
The binding specifications in a <code>data-bind</code> attribute are evaluated as JavaScript
code.  This means it can contain any JavaScript code which produces a binding
object.  Thus, HotDrink provides several factory functions that create common
binding specifications.
</p>
</div>
