docs/howto/basics.org
** The example

This is the same as the previous example, except the binding specification
objects are created using factory functions.

#+HTML: <div class="results">
#+INCLUDE: tangle/fact-bind.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/fact-bind.js html
#+HTML: })()
#+HTML: </script>

#+CAPTION: /View/ (show/hide)
#+BEGIN_SRC html -n :exports code :tangle tangle/fact-bind.html :padline no
<div id="ex7">
  X: <input type="text" data-bind="hd.edit( x )"/>
           &rArr; <span data-bind="hd.text( x )"></span><br/>
  Y: <input type="text" data-bind="hd.num( y )"/>
           &rArr; <span data-bind="hd.text( y )"></span>
</div>
#+END_SRC

#+CAPTION: /View-Model/ (show/hide)
#+BEGIN_SRC js -n :exports code :tangle tangle/fact-bind.js :padline no
var context = new hd.ContextBuilder()
    .v( 'x', 'Hello, again!' ).v( 'y', 3 ).context();

var pm = new hd.PropertyModel();
pm.addComponent( context );
#+END_SRC

#+CAPTION: /Binding/ (show/hide)
#+BEGIN_SRC js -n :exports code :tangle tangle/fact-bind.js :padline no
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( context, document.getElementById( 'ex7' ) );
} );
#+END_SRC


** Factory functions

Binding specification objects tend to be lengthy and follow the same basic
patterns.  Since the ~data-bind~ attribute is simply evaluated as JavaScript
code, we can use any JavaScript code we want to create these objects---e.g.,
call a factory function to create the object for us.

HotDrink provides several factory functions for creating these objects.  There
is nothing special about these factory functions, and you are encouraged to
make your own.  For example, the function ~hd.edit~ looks basically like the
following:

#+BEGIN_SRC js
hd.edit = function( model, toView, toModel ) {
  return {mkview:  hd.Edit,
          model:   model,
          toView:  toView,
          toModel: toModel
         };
}
#+END_SRC

A full list of the factory functions can be found in the [[file:binding.org][Advanced Binding
Concepts]] how-to, but for now we point out the following three:

1. The ~hd.edit~ factory creates the binding specification for a text edit
   box.
2. The ~hd.num~ factory also creates a specification for a text edit box,
   but the value is converted to a number before passing it to the model.
   Note that this factory takes a second optional argument which is used to
   specify the number of digits after the decimal point.
3. The ~hd.text~ factory creates the binding specification for replacing the
   contents of a tag with the value of a variable.

* Shortcut: equations

HotDrink does not inherently know how to solve any type of constraint; it
relies on the programmer to provide constraint satisfaction methods.  That
being said, because many constraints can be represented as very simple
mathematical equations, HotDrink includes a very basic equation parser which
can translate simple equations into a set of constraint satisfaction methods.
You are welcome to use this parser to avoid writing certain types of trivial
methods.

** The example

In this example we can calculate the minimum payment required on an account
balance based on a given percentage of the balance.  We can also specify the
actual payment made, though it must be higher than the minimum.

#+HTML: <div class="results">
#+INCLUDE: tangle/eq.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/eq.js html
#+HTML: })();
#+HTML: </script>

#+BEGIN_SRC html -n :exports code :tangle tangle/eq.html :padline no
<table style="text-align: right" id="ex8">
  <tr><td>
    Account Balance: <input type="text" data-bind="hd.num( balance, 2 )"/><br/>
    Minimum Percentage: <input type="text" data-bind="hd.num( min_rate, 3 )"/><br/>
    Minimum Payment: <input type="text" data-bind="hd.num( min_pay, 2 )"/><br/>
    <hr/>
    Payment Made: <input type="text" data-bind="hd.num( pay, 2 )"/>
  </td></tr>
</table>
#+END_SRC

#+BEGIN_SRC js -n :exports code :tangle tangle/eq.js :padline no
var context = new hd.ContextBuilder()
  .vs( 'balance, min_rate, min_pay, pay', {balance: 4000, min_rate: 6.125} )
  .equation( "min_pay == balance * min_rate / 100" )
  .equation( "pay >= min_pay" )
  .context();

var pm = new hd.PropertyModel();
pm.addComponent( context );

window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( context, document.getElementById( 'ex8' ) );
} );
#+END_SRC

