howto/basics.html

<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> The example</h3>
<div class="outline-text-3" id="text-10-1">
<p>
This is the same as the previous example, except the binding specification
objects are created using factory functions.
</p>

<div class="results">
<div id="ex7">
  X: <input type="text" data-bind="hd.edit( x )"/>
           &rArr; <span data-bind="hd.text( x )"></span><br/>
  Y: <input type="text" data-bind="hd.num( y )"/>
           &rArr; <span data-bind="hd.text( y )"></span>
</div>
</div>
<script type="text/javascript">
(function() {
var context = new hd.ContextBuilder()
    .v( 'x', 'Hello, again!' ).v( 'y', 3 ).context();

var pm = new hd.PropertyModel();
pm.addComponent( context );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( context, document.getElementById( 'ex7' ) );
} );
})()
</script>

<div class="org-src-container">
<label class="org-src-name"><i>View</i> (show/hide)</label>
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex7"</span>&gt;
<span class="linenr">2: </span>  X: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.edit( x )"</span>/&gt;
<span class="linenr">3: </span>           <span style="color: #BA36A5;">&amp;rArr;</span> &lt;<span style="color: #006699;">span</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( x )"</span>&gt;&lt;/<span style="color: #006699;">span</span>&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">4: </span>  Y: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( y )"</span>/&gt;
<span class="linenr">5: </span>           <span style="color: #BA36A5;">&amp;rArr;</span> &lt;<span style="color: #006699;">span</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( y )"</span>&gt;&lt;/<span style="color: #006699;">span</span>&gt;
<span class="linenr">6: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>View-Model</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">context</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ContextBuilder</span>()
<span class="linenr">2: </span>    .v( <span style="color: #008000;">'x'</span>, <span style="color: #008000;">'Hello, again!'</span> ).v( <span style="color: #008000;">'y'</span>, 3 ).context();
<span class="linenr">3: </span>
<span class="linenr">4: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">pm</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.PropertyModel</span>();
<span class="linenr">5: </span>pm.addComponent( context );
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><i>Binding</i> (show/hide)</label>
<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( context, document.getElementById( <span style="color: #008000;">'ex7'</span> ) );
<span class="linenr">3: </span>} );
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Factory functions</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Binding specification objects tend to be lengthy and follow the same basic
patterns.  Since the <code>data-bind</code> attribute is simply evaluated as JavaScript
code, we can use any JavaScript code we want to create these objects&#x2014;e.g.,
call a factory function to create the object for us.
</p>

<p>
HotDrink provides several factory functions for creating these objects.  There
is nothing special about these factory functions, and you are encouraged to
make your own.  For example, the function <code>hd.edit</code> looks basically like the
following:
</p>

<div class="org-src-container">

<pre class="src src-js">hd.edit = <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">model</span>, <span style="color: #BA36A5;">toView</span>, <span style="color: #BA36A5;">toModel</span> ) {
  <span style="color: #0000FF;">return</span> {mkview:  hd.Edit,
          model:   model,
          toView:  toView,
          toModel: toModel
         };
}
</pre>
</div>

<p>
A full list of the factory functions can be found in the <a href="binding.html">Advanced Binding
Concepts</a> how-to, but for now we point out the following three:
</p>

<ol class="org-ol">
<li>The <code>hd.edit</code> factory creates the binding specification for a text edit
box.
</li>
<li>The <code>hd.num</code> factory also creates a specification for a text edit box,
but the value is converted to a number before passing it to the model.
Note that this factory takes a second optional argument which is used to
specify the number of digits after the decimal point.
</li>
<li>The <code>hd.text</code> factory creates the binding specification for replacing the
contents of a tag with the value of a variable.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Shortcut: equations</h2>
<div class="outline-text-2" id="text-11">
<p>
HotDrink does not inherently know how to solve any type of constraint; it
relies on the programmer to provide constraint satisfaction methods.  That
being said, because many constraints can be represented as very simple
mathematical equations, HotDrink includes a very basic equation parser which
can translate simple equations into a set of constraint satisfaction methods.
You are welcome to use this parser to avoid writing certain types of trivial
methods.
</p>
</div>

<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> The example</h3>
<div class="outline-text-3" id="text-11-1">
<p>
In this example we can calculate the minimum payment required on an account
balance based on a given percentage of the balance.  We can also specify the
actual payment made, though it must be higher than the minimum.
</p>

<div class="results">
<table style="text-align: right" id="ex8">
  <tr><td>
    Account Balance: <input type="text" data-bind="hd.num( balance, 2 )"/><br/>
    Minimum Percentage: <input type="text" data-bind="hd.num( min_rate, 3 )"/><br/>
    Minimum Payment: <input type="text" data-bind="hd.num( min_pay, 2 )"/><br/>
    <hr/>
    Payment Made: <input type="text" data-bind="hd.num( pay, 2 )"/>
  </td></tr>
</table>
</div>
<script type="text/javascript">
(function() {
var context = new hd.ContextBuilder()
  .vs( 'balance, min_rate, min_pay, pay', {balance: 4000, min_rate: 6.125} )
  .equation( "min_pay == balance * min_rate / 100" )
  .equation( "pay >= min_pay" )
  .context();

var pm = new hd.PropertyModel();
pm.addComponent( context );

window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( context, document.getElementById( 'ex8' ) );
} );
})();
</script>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #006699;">table</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"text-align: right"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex8"</span>&gt;
<span class="linenr">2: </span>  &lt;<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">td</span>&gt;
<span class="linenr">3: </span>    Account Balance: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( balance, 2 )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">4: </span>    Minimum Percentage: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( min_rate, 3 )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">5: </span>    Minimum Payment: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( min_pay, 2 )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">6: </span>    &lt;<span style="color: #006699;">hr</span>/&gt;
<span class="linenr">7: </span>    Payment Made: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( pay, 2 )"</span>/&gt;
<span class="linenr">8: </span>  &lt;/<span style="color: #006699;">td</span>&gt;&lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr">9: </span>&lt;/<span style="color: #006699;">table</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">context</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ContextBuilder</span>()
<span class="linenr"> 2: </span>  .vs( <span style="color: #008000;">'balance, min_rate, min_pay, pay'</span>, {balance: 4000, min_rate: 6.125} )
<span class="linenr"> 3: </span>  .equation( <span style="color: #008000;">"min_pay == balance * min_rate / 100"</span> )
<span class="linenr"> 4: </span>  .equation( <span style="color: #008000;">"pay &gt;= min_pay"</span> )
<span class="linenr"> 5: </span>  .context();
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">pm</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.PropertyModel</span>();
<span class="linenr"> 8: </span>pm.addComponent( context );
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">11: </span>  hd.performDeclaredBindings( context, document.getElementById( <span style="color: #008000;">'ex8'</span> ) );
<span class="linenr">12: </span>} );
</pre>
</div>
</div>
</div>
