howto/basics.html

<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Allowable equations</h3>
<div class="outline-text-3" id="text-11-2">
<p>
HotDrink is <i>not</i> a program for solving mathematical equations.  However,
simple equations like the ones in this example are common and are not hard to
solve.  Therefore, as a convenience, HotDrink provides this shortcut method
for creating constraints from <i>simple</i> equations.
</p>

<p>
The equations which HotDrink can enforce are those in which (1) no variable
appears in the equation more than once, and (2) the only operations are add
(<code>+</code>), subtract (<code>-</code>), multiply (<code>*</code>), and divide (<code>/</code>).  This means, e.g., no
exponents, no square roots, etc.
</p>

<p>
Note that, despite the name, the <code>equation</code> member function can also parse
inequalities.  Thus, the allowable comparison operators in an equation are
<code>==</code>, <code>&lt;=</code>, and <code>&gt;=</code>.
</p>

<p>
Examples of valid equations:
</p>

<ul class="org-ul">
<li><code>width == right - left</code>
</li>
<li><code>aspect == width / height</code>
</li>
<li><code>surface == (2*width + 2*length) * height</code>
</li>
</ul>

<p>
Examples of invalid equations:
</p>

<ul class="org-ul">
<li><code>perimeter = width + height + width + height</code>
</li>
<li><code>area == 3.14*radius^2</code>
</li>
<li><code>side == sqrt(area)</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> Implementation</h3>
<div class="outline-text-3" id="text-11-3">
<p>
HotDrink implements these equations by parsing them and then, for each
variable, constructing a function which solves for that variable.  Each of
these functions then becomes a method.  Thus, the constraint will have as many
methods as there are variables, with each method updating exactly one
variable.
</p>

<p>
To be clear, the <code>equation</code> function's only advantage is that it saves you
some typing; in the end you still get a normal constraint, the same as if you
had written the methods yourself.
</p>

<p>
As you probably expect by now, the <code>equation</code> member function returns the
builder.  It can be abbreviated <code>eq</code>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-10-27 Tue 08:33</p>
<p class="validation"></p>
</div>
</body>
</html>
